{
    "762": {
        "first_name": "Tony",
        "last_name": "Ciochetti",
        "faculty_title": "Elmo James Burke Jr. Chair in Real Estate Finance and Development  <br>Executive Director Embrey Real Estate Finance and Development Program",
        "faculty_email": "Tony.Ciochetti@utsa.edu",
        "faculty_phone": "210-458-8759",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.30",
        "faculty_pdf": 1599,
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Real Estate Finance and Development Program",
                "role": "Administrators"
            },
            {
                "department": "Finance",
                "role": "Faculty"
            }
        ],
        "uri": "tony-ciochetti",
        "fullname": "Tony Ciochetti, Ph.D.",
        "id": 762,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/tony-ciochetti/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/762",
        "media": [
            {
                "id": 23926,
                "alt": "Tony Ciochetti",
                "path": "uploads/2017/09/Dr.-Tony-Ciochetti-scaled.jpg",
                "correctedPath": "faculty/headshots/real-estate-finance-and-development-program/762-tony-ciochetti.jpg"
            }
        ],
        "topd": "Real Estate Finance and Development Program",
        "dslug": "real-estate-finance-and-development-program",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. University of Wisconsin-Madison</li>\n<li>M.S. University of Wisconsin-Madison</li>\n<li>B.S. University of Oregon</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Dr. Tony Ciochetti is the E.J. Burke Jr. Chair, and Executive Director of the Embrey Real Estate Finance and Development Programs at the Carlos Alvarez College of Business. Dr. Ciochetti came to UTSA from the Massachusetts Institute of Technology, where he was the Thomas G. Eastman Chair and Chairman of the Center for Real Estate. Prior to his appointment at MIT, Dr. Ciochetti was a professor of Finance and served as the director of the Center for Real Estate Development at the University of North Carolina in Chapel Hill. Dr. Ciochetti received his B.A. in Finance from the University of Oregon, and both his M.S. and Ph.D. in Real Estate and Urban Land Economics from the University of Wisconsin-Madison. Prior to his academic career, Dr. Ciochetti spent nearly a decade in the areas of commercial real estate development and consulting.</p>\n<p>Dr. Ciochetti is active in international real estate education, and has taught frequently in Asia, Africa, Europe and the Middle East. He assisted in creating a new graduate program in real estate finance and development at Cambridge University and was a Senior Visiting Professor there for six years. He has created or taught courses in real estate finance and development at MIT, University of Pennsylvania, Cambridge University, University of Wisconsin-Madison, Indiana University and the University of North Carolina-Chapel Hill. Dr. Ciochetti also teaches executive courses on topics such as real estate development, portfolio and asset management and asset securitization for both industry and academic organizations. His research has appeared in leading scholarly journals including <em>Review of Financial Studies</em>, <em>Real Estate Economics</em>, the <em>Journal of Real Estate Finance and Economics </em>and the <em>Journal of Real Estate Research</em>.</p>\n<p>Dr. Ciochetti is the former president of the Real Estate Research Institute, where he is also an academic fellow, and current Advisory Board member. He has also served on the Board of Directors of Real Estate Economics, the Real Estate Research Institute, and Real Estate Finance. He regularly consults on behalf of investment banks, rating agencies, institutional clients and development companies and is an active board member on a number of commercial real estate companies both domestically and internationally.</p>\n<h3><strong>Research Interests</strong></h3>\n<ul>\n<li>Commercial mortgage credit risk<u></u></li>\n<li>Role of real estate within pension plan portfolios</li>\n<li>ESG and its role in the built environment</li>\n</ul>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li>“Zipf’s Law: The Case of International Real Estate,” (with James D. Shilling), <em>Journal of Real Estate</em>, Vol. 2, 2015, pp. 91-110.</li>\n<li>“The Role of Public Markets in International Real Estate Diversification,” (with Rose Lai and James D. Shilling), <em>International Real Estate Review</em>, Vol. 18, No. 2, 2015, pp. 155-175.</li>\n<li>“Are Commercial Mortgage Defaults Affected by Tax Considerations?” with Hoon Cho and James D. Shilling, <em>Journal of Real Estate Finance and Economics</em>, forthcoming, Online DOI: 10.1007/S11145-011, May 17, 2011.</li>\n<li>“Carbon Markets: A Hidden Source for Commercial Real Estate,” with Aaron G. Binkley, <em>Journal of Sustainable Real Estate</em>, Vol. 2, No. 1, 2010, pp. 67-90.</li>\n<li>“Energy Efficiency Investments: Do They Pay?” with Mark D. McGowan, <em>Journal of Sustainable Real Estate</em>, Vol. 2, No. 1, 2010, pp. 305-334.</li>\n<li>“Loss Recovery, Realized Excess Returns and Credit Rationing in the Commercial Mortgage Markets,” with James D. Shilling, <em>Journal of Real Estate Finance and Economics</em>, Vol. 34, 2007, pp. 425-445.</li>\n<li>“Theory and Evidence on the Resolution of Financial Distress,” with David T. Brown, and Timothy J. Riddiough, <em>Review of Financial Studies,</em> Vol. 19, Winter 2006, pp. 1357-1397.</li>\n<li>“A Proportional Hazards Model of Commercial Mortgage Default and Originator Bias,” with Yongheng Deng, Gail Lee, James D. Shilling and Rui Yao, <em>Journal of Real Estate Finance and Economics, </em>Vol. 27, 2003, pp. 5-23.</li>\n<li>“The Termination of Commercial Mortgage Contracts through Prepayment and Default: A Proportional Hazard Approach with Competing Risks,” with Yongheng Deng, Bin Gao and Rui Yao, <em>Real Estate Economics, </em>Vol. 30, 2002, pp. 595-634.</li>\n<li>“Characteristics of Institutional Investment in Real Estate Investment Trusts,” with Timothy M. Craft and James D. Shilling, <em>Real Estate Economics, </em>Vol. 30, 2002, pp. 567-593<em>.</em></li>\n<li>“Pension Plan Real Estate Investment in an Asset/Liability Framework,” with Gregory C. Chun and James D. Shilling, <em>Real Estate Economics, </em>Vol. 23, 2000, pp. 467-491.</li>\n</ul>\n",
        "department": [
            "real estate finance and development program",
            "finance"
        ],
        "roles": [
            "administrators",
            "faculty"
        ]
    },
    "1348": {
        "first_name": "Emeka",
        "last_name": "Nwaeze",
        "faculty_title": "Professor of Accounting",
        "faculty_email": "emeka.nwaeze@utsa.edu",
        "faculty_phone": "210-458-7462",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": 10443,
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Accounting",
                "role": "Faculty"
            }
        ],
        "uri": "emeka-nwaeze",
        "fullname": "Emeka Nwaeze, Ph.D.",
        "id": 1348,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/emeka-nwaeze/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1348",
        "media": [
            {
                "id": 1349,
                "alt": "Emeka Nwaeze",
                "path": "uploads/2017/11/enwaeze-e1528228049642.jpg",
                "correctedPath": "faculty/headshots/doctoral-studies/1348-emeka-nwaeze.jpg"
            }
        ],
        "topd": "Doctoral Studies",
        "dslug": "doctoral-studies",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. University of Connecticut</li>\n<li>M.P.A. Southern University, Louisiana</li>\n<li>B.S.A Southern University, Louisiana</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Dr. Nwaeze is a professor of accounting at The University of Texas at San Antonio. He has taught at UTSA since 2006. He previously taught at Rutgers University. He teaches at the undergraduate, graduate and doctoral level. Courses have included Accounting for Financial Analysis, Business Analysis and Valuation, Cost Accounting, Financial Statement Analysis and Management Accounting.</p>\n<p>He is a member of the American Accounting Association and the Financial Management Association. He received the Accounting Teaching Award in 2011 from the MBA Association.</p>\n<h3><strong>Research Interests</strong></h3>\n<ul>\n<li>Institutions of regulation, accounting information and corporate performance</li>\n<li>Firm information environment and security prices</li>\n</ul>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li>“Public Re-Release of Going-Concern Opinions and Market Reaction,” <em>Accounting and Business Research</em>, Vol. 47, No. 3, 2017, pp. 237-267.\n<div class=\"off-canvas-content\" data-off-canvas-content=\"\">\n<div id=\"content\"></div>\n</div>\n</li>\n<li>“Directors and Officers Liability Insurance: Implications for Abnormal Coverage,” (with R. Kalelkar), <em>Journal of Accounting, Auditing, and Finance</em>, Vol. 30, No. 1, 2015, pp. 3-34.</li>\n<li>“Healthcare Reform Proposal and the Behavior of Pharmaceutical Companies: The Role of Political Costs,” (with M. Hao), <em>Accounting Horizons</em>, Vol. 29, No. 1, 2015, pp. 171-198.</li>\n<li>“Are Incentives for Earnings Management Reflected in the ERC: Large Sample Evidence,” <em>Advances in Accounting</em>, Vol. 27, June 2011, pp. 26-38.</li>\n<li>“Sarbanes-Oxley Act and the Quality of Earnings and Accruals: Market-based Evidence,” with R. Kalelkar, <em>Journal of Accounting and Public Policy</em>, Vol. 30, May/June 2011, pp. 275-294.</li>\n<li>“Accounting Information and CEO Compensation: The Role of Cash Flow from Operations in the Presence of Earnings,” with S. M. Simon, Q. Yang and Jennifer Yin, <em>Contemporary Accounting Research</em>, Vol. 23, Spring 2006, pp. 227-265.</li>\n<li>“Replacement Versus Adaptation Investments and Equity Value,” <em>Journal of Corporate Finance</em>, Vol. 11, June 2005, pp. 523-549.</li>\n<li>“Valuation Relevance of Allowance for Funds Used During Construction and Operating Income: The Effects of Regulatory Climates and Deregulation,” with A. Lulseged, <em>Review of Quantitative Finance &amp; Accounting</em>, Vol. 9, September 2002, pp. 131-152.</li>\n<li>“The Adjustment Process of Accruals: Empirical Evidence and Implication for Accrual Research,” <em>Review of Quantitative Finance and Accounting</em>, Vol. 17, September 2001, pp. 187-211.</li>\n<li>“Deregulation of the Electric Power Industry: The Earnings, Risk, and Return Effects,” <em>Journal of Regulatory Economics</em>, Vol. 17, January 2000, pp. 49-67.</li>\n</ul>\n",
        "department": [
            "accounting"
        ],
        "roles": [
            "faculty"
        ]
    },
    "1361": {
        "first_name": "Sharon",
        "last_name": "Stevens",
        "faculty_title": "Business Service Center Specialist III",
        "faculty_email": "sharon.stevens@utsa.edu",
        "faculty_phone": "210-458-6408",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "sharon-stevens",
        "fullname": "Sharon Stevens",
        "id": 1361,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/sharon-stevens/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1361",
        "media": [
            {
                "id": 9878,
                "alt": "Sharon Stevens",
                "path": "uploads/2017/11/sharon_stevens.jpg",
                "correctedPath": "faculty/headshots/business-service-center/1361-sharon-stevens.jpg"
            }
        ],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "1408": {
        "first_name": "Juan Manuel",
        "last_name": "Sanchez",
        "faculty_title": "Senior Associate Dean for Faculty Success and Research<br>Professor of Accounting",
        "faculty_email": "juan.manuel.sanchez@utsa.edu",
        "faculty_phone": "210-458-5572",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Accounting",
                "role": "Faculty"
            },
            {
                "department": "Doctoral Studies",
                "role": "Administrators"
            },
            {
                "department": "Faculty Success and Research",
                "role": "Administrators"
            }
        ],
        "uri": "juan-manuel-sanchez",
        "fullname": "Juan Manuel Sanchez, Ph.D.",
        "id": 1408,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/juan-manuel-sanchez/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1408",
        "media": [
            {
                "id": 6272,
                "alt": "Juan Manuel Sanchez",
                "path": "uploads/2017/11/Juan_Manuel_Sanchez.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/1408-juan-manuel-sanchez.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. The University of Texas at San Antonio</li>\n<li>M.S. St. Mary&#8217;s University</li>\n<li>MBA St. Mary&#8217;s University</li>\n<li>BBA St. Mary&#8217;s University</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Dr. Juan Manuel Sanchez obtained his Ph.D. in accounting from The University of Texas at San Antonio in 2006 after working for global firms including Deloitte (a global accounting firm) and SBC Communications (now AT&amp;T). Dr. Sanchez has published in elite accounting, finance and multidisciplinary journals such as <em>The Accounting Review</em>, <em>Journal of Accounting Research</em>, <em>Journal of Financial Economics</em>, <em>Journal of Business Ethics</em>, <em>Journal of Business Finance and Accounting</em>, <em>Accounting Horizons</em>, <em>Journal of Accounting and Public Policy</em>, <em>Journal of Accounting</em>, <em>Auditing and Finance</em>, and <em>Journal of Information Systems</em>.</p>\n<p>His research is widely cited by academics and major media outlets including, <em>The Wall Street Journal</em>, CFO.com, <em>Accounting Today</em>, <em>Compliance Week</em>, and <em>Harvard Law School Forum on Corporate Governance and Financial Regulation</em>. According to BYU Author Rankings Sanchez&#8217; research ranks him in the first (top) decile among all accounting researchers. For more details about his research, please visit his <a href=\"https://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=397223\" target=\"_blank\" rel=\"noopener noreferrer\">SSRN Author Page</a>.</p>\n<h3><strong>Research Interests</strong></h3>\n<ul>\n<li>Executive compensation</li>\n<li>Corporate governance</li>\n<li>Financial reporting issues</li>\n<li>Accounting information systems</li>\n</ul>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li>“Investor Sentiment and Stock Option Vesting Terms,” with Sami Keskek and Shawn Huang, <em>Management Science</em>, forthcoming.</li>\n<li>“The Influence of Chief Sustainability Officers on Performance,” with Andrea Romi and Gary Peters, <em>Journal of Business Ethics</em>, forthcoming.</li>\n<li>“Examining the Stock Performance of Acquirers where the Acquirer or Target Hold Patents,” with Derek Oler and Kevin Kim, <em>Review of Quantitative Finance and Accounting,</em> Vol. 56, 2021, pp. 185-217.</li>\n<li>“The Influence of CSR on Investment Efficiency and Innovation,” with Kirsten Cook, Andrea Romi and Daniela Sanchez, J<em>ournal of Business Finance and Accounting,</em> (Vol. 46, No. 3-4, 2019, pp. 494-537.</li>\n<li>&#8220;How Powerful CFOs Camouflage and Exploit Equity-Based Incentive Compensation,&#8221; with Stacey Kaden, Denton Collins and Gary Fleischman, <em>Journal of Business Ethics</em>, Vol. 153, No. 2, 2018, pp. 591-613.</li>\n<li>&#8220;CEO Inside Debt Incentives and Corporate Tax Sheltering,&#8221; with Sabrina Chi and Shawn Huang, <em>Journal of Accounting Research</em>, Vol. 55, No. 4, 2017, pp. 837-876.</li>\n<li>&#8220;Non-Compliance in CEO Compensation Disclosure: The Brazilian Experience,&#8221; with Cristiano Costa, Fernando Galdi and Fabio Motoki, <em>Journal of Business Finance and Accounting</em>, Vol. 43, No. 3, 2016, pp. 329-369.</li>\n<li>&#8220;Forecasting Without Consequence? Evidence on the Properties of Retiring CEOs&#8217; Forecasts of Future Earnings,&#8221; with Cory Cassell, Shawn Huang, <em>The Accounting Review</em>, Vol. 88, No. 6), 2013, pp. 1909-1937.</li>\n<li>&#8220;Seeking Safety: The Relation Between CEO Inside Debt Holdings and the Riskiness of Firm Investment and Financial Policies,&#8221; with Cory Cassell, Shawn Huang and Mike Stuart, <em>Journal of Financial Economics</em>, Vol. 103, No. 3, 2012, pp. 588-610.</li>\n<li>&#8220;Special Items: A Descriptive Analysis,&#8221; with Peter M. Johnson and Thomas Lopez, <em>Accounting Horizons</em>, Vol. 25, No. 3, 2011, pp. 511-536.</li>\n<li>&#8220;Examining the Potential Benefits of Internal Control Monitoring Technology,&#8221; with Adi Masli, Vernon Richardson and Gary Peters, <em>The Accounting Review</em>, Vol. 85, No. 3, 2010, pp. 1001-1034.</li>\n<li>&#8220;Layoffs and CEO Compensation: Does CEO Power Influence the Relationship?&#8221; with Charlene Henderson, Adi Masli, and Vernon Richardson, <em>The Journal of Accounting, Auditing and Finance</em>, Vol. 25, No. 4, 2010, pp. 673-707.</li>\n<li>&#8220;Social Responsibility and Corporate Reputation: The Case of the Arthur Andersen Enron Audit Failure,&#8221; with Cheryl Linthicum and Austin L. Reitenga, <em>Journal of Accounting and Public Policy</em>, Vol. 29, No. 2, Mar/Apr 2010, pp. 160-176.</li>\n<li>&#8220;Earnings Restatements, the Sarbanes-Oxley Act and the Disciplining of Chief Financial Officers,&#8221; with Denton Collins, Adi Masli and Austin L. Reitenga, <em>The Journal of Accounting, Auditing and Finance</em>, Vol. 24, No. 1, 2009, pp. 1-34. (Lead Article)</li>\n<li>&#8220;Repairing Organizational Legitimacy Following Information Technology (IT) Material Weaknesses: Executive Turnover, IT Expertise, IT System Upgrades,&#8221; with Jacob Haislip, Adi Masli and Vern Richardson, <em>Journal of Information Systems</em>, Vol. 30, No. 1, 2016, pp. 41-70.</li>\n<li>&#8220;The Interrelationships Between Information Technology Spending, CEO Compensation and Firm Value,&#8221; with Adi Masli, Vernon Richardson and Rodney Smith, <em>Journal of Information Systems</em>, Vol. 28, No. 2, 2014, pp. 41-65.</li>\n<li>&#8220;The Business Value of IT Research: A Synthesis and Framework of Archival Research,&#8221; with Adi Masli, Vernon Richardson and Rod E. Smith, <em>Journal of Information Systems</em>, Vol. 25, No. 2, 2011, pp. 81-116.</li>\n</ul>\n",
        "department": [
            "accounting",
            "doctoral studies",
            "faculty success and research"
        ],
        "roles": [
            "faculty",
            "administrators",
            "administrators"
        ]
    },
    "1497": {
        "first_name": "Lynda",
        "last_name": "de la Viña",
        "faculty_title": "Emeritus Professor",
        "faculty_email": "lynda.delavina@utsa.edu",
        "faculty_phone": "210-458-8127",
        "faculty_fax": "210-458-4308",
        "faculty_office_number": "",
        "faculty_pdf": 13251,
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Economics",
                "role": "Emeritus Faculty"
            }
        ],
        "uri": "lynda-de-la-vina",
        "fullname": "Lynda Y. de la Vina, Ph.D.",
        "id": 1497,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/lynda-de-la-vina/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1497",
        "media": [
            {
                "id": 1510,
                "alt": "Lynda Y. de la Viña",
                "path": "uploads/2017/11/LyndadelaVina-e1533307191727.jpg",
                "correctedPath": "faculty/headshots/center-for-global-entrepreneurship/1497-lynda-de-la-vina.jpg"
            }
        ],
        "topd": "Center for Global Entrepreneurship",
        "dslug": "center-for-global-entrepreneurship",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. Rice University</li>\n<li>M.A. Rice University</li>\n<li>B.A. University of Texas, Pan American</li>\n<li>Post-Graduate Study Columbia University</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Dr. Lynda de la Viña is the Peter Flawn Professor in the Department of Entrepreneurship and Technology Management and the Director of the Center for Global Entrepreneurship. She previously served as Dean of the Carlos Alvarez College of Business from 2004-2012.</p>\n<p>Dr. de la Viña was named one of the 100 Most Influential Hispanics by <em>Hispanic Business</em> magazine, and has received both the Ford Salute to Education Award as well as the Jessie and Sue Oppenheimer Award of Excellence. She was an inaugural member of the advisory committee for the State of Texas Emerging Technology Fund, a $200 million fund created to foster innovation, research and job creation in emerging high-tech industries. She also completed a prestigious Kellogg Leadership Fellows Program.</p>\n<p>With a distinguished career in academia and government service, Dr. de la Viña was the first Mexican-American woman at the secretarial level of the U.S. Treasury, where she served as Deputy Assistant Secretary for Economic Policy from 1998-2001. While her work portfolio was expansive dealing with domestic and international economic policy issues, she led Treasury teams on issues of personal commitment such as financial literacy, entrepreneurship development and U.S.-Mexico border development. Following her role at the Treasury, she joined Johns Hopkins University as associate dean of the Graduate Division of Business and Management, full professor and chair of the Department of Finance and International Business.</p>\n<p>Prior to her career in Washington, D.C. and Baltimore, Maryland, Dr. de la Viña served 19 years at UTSA in ascending positions of administrative responsibility. She joined the Department of Economics faculty in 1982 and was named executive director of the Institute for Studies in Business in 1985. She served as associate dean of graduate studies and research in the college from 1993-1998.</p>\n<p>She has co-founded several companies including Operational Technologies Corporation (OpTech) and Pronucleotein Biotechnologies in San Antonio, TX. Under her tenure, OpTech rose from a small incubator operation in downtown San Antonio to one of the largest minority-owned businesses in San Antonio. She continues to serve on the Board of Directors of OpTech. She also serves on the boards of the Center for International Private Enterprise, an affiliate of the U.S. Chamber of Commerce; the World Affairs Council; the Free Trade Alliance; and the Alamo Public Telecommunications Council.</p>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li>“Equity Crowdfunding,” (with Stephanie Black), in <em>Educating Social Entrepreneurs: A Workbook of Cases, Exercises and Commentaries</em>, Business Expert Press, 2017</li>\n<li>“The Impact of Lean Enterprise Transformation on Production Learning Curves Used by Technology Managers in Aerospace Companies: A Decomposition-Based Model of Unit Derived Learning Curve Data,” with Cory Hallam, <em>Proceedings of Portland International Conference on Management of Engineering and Technology</em> (PICMET), Portland, OR, August 2011.</li>\n<li>“Comparative Analysis of Work Force Management Techniques Between Lean and Traditional Manufacturing Companies: A Quantitative Decision Tool for Choosing Between Layoffs and Continual Improvements,” with Cory Hallam and Susan Hammond, <em>Proceedings of the Portland International Conference on Management of Engineering and Technology </em>(PICMET), Phuket, Thailand, July 2010.</li>\n<li>“Analysis of the Toyota Production System and the Genesis of Six Sigma Programs: An Imperative for Understanding Failures in Technology Management Culture Transformation in Traditional Manufacturing Companies,” with Cory R. A. Hallam and Justin Muesel, <em>Proceedings of the Portland International Conference on Management of Engineering and Technology</em> (PICMET), Phuket, Thailand, July 2010.</li>\n<li>“Improve Technology Transfer with this Alliance Scorecard,” with J. Michael Munson, Woodie Spivey and Fu-Sen Tsai, in <em>Research-Technology Management</em>, Vol. 52, No. 1, Jan-Feb 2009, pp. 10-18.</li>\n</ul>\n<div class=\"off-canvas-wrapper\">\n<div class=\"off-canvas-content\" data-off-canvas-content=\"\">\n<div id=\"content\">\n<div id=\"inner-content\" class=\"row expanded\">\n<div class=\"content-wrap\"></div>\n</div>\n</div>\n</div>\n</div>\n",
        "department": [
            "economics"
        ],
        "roles": [
            "emeritus faculty"
        ]
    },
    "1612": {
        "first_name": "Willard",
        "last_name": "McIntosh",
        "faculty_title": "Adjunct Professor in Finance",
        "faculty_email": "will.mcintosh@utsa.edu",
        "faculty_phone": "210-641-8416",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.30",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Finance",
                "role": "Faculty"
            },
            {
                "department": "Real Estate Finance and Development Program",
                "role": "Faculty"
            }
        ],
        "uri": "willard-mcintosh",
        "fullname": "Willard McIntosh, Ph.D.",
        "id": 1612,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/willard-mcintosh/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1612",
        "media": [],
        "topd": "Real Estate Finance and Development Program",
        "dslug": "real-estate-finance-and-development-program",
        "content": "",
        "department": [
            "finance",
            "real estate finance and development program"
        ],
        "roles": [
            "faculty",
            "faculty"
        ]
    },
    "1616": {
        "first_name": "Michael",
        "last_name": "Noll",
        "faculty_title": "Lecturer in Finance",
        "faculty_email": "michael.noll@utsa.edu",
        "faculty_phone": "210-458-7333",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.30",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Finance",
                "role": "Faculty"
            },
            {
                "department": "Real Estate Finance and Development Program",
                "role": "Faculty"
            }
        ],
        "uri": "michael-noll",
        "fullname": "Michael Noll",
        "id": 1616,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/michael-noll/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1616",
        "media": [],
        "topd": "Real Estate Finance and Development Program",
        "dslug": "real-estate-finance-and-development-program",
        "content": "",
        "department": [
            "finance",
            "real estate finance and development program"
        ],
        "roles": [
            "faculty",
            "faculty"
        ]
    },
    "1713": {
        "first_name": "Raymond",
        "last_name": "Teske",
        "faculty_title": "Professor of Practice in Finance <br> Assistant Director RFD Program",
        "faculty_email": "ray.teske@utsa.edu",
        "faculty_phone": "210-458-7333",
        "faculty_fax": "210.458.5783",
        "faculty_office_number": "BB 4.06.30B",
        "faculty_pdf": 1731,
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Real Estate Finance and Development Program",
                "role": "Faculty"
            },
            {
                "department": "Finance",
                "role": "Faculty"
            }
        ],
        "uri": "raymond-teske",
        "fullname": "Raymond H. C. Teske III, JD",
        "id": 1713,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/raymond-teske/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1713",
        "media": [
            {
                "id": 1732,
                "alt": "Raymond Teske",
                "path": "uploads/2017/11/RaymondTeske.jpg",
                "correctedPath": "faculty/headshots/real-estate-finance-and-development-program/1713-raymond-teske.jpg"
            }
        ],
        "topd": "Real Estate Finance and Development Program",
        "dslug": "real-estate-finance-and-development-program",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>MBA The University of Texas at San Antonio (Executive MBA)</li>\n<li>J.D. South Texas College of Law</li>\n<li>B.A. Baylor University</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Ray Teske is the assistant director of the UTSA Real Estate Finance and Development Program. His primary responsibility is bridging the gap between the classroom and the practical application of real estate principles by integrating the students within the San Antonio real estate community. He is a full-time, non-tenured lecturer assigned to both the the Department of Finance (teaching Real Estate Principles) and the Department of Management (teaching Real Estate Law).<br />\nRay Teske has worked and taught at UTSA since 2004, starting with the UTSA Paralegal Certificate Program in the Center for Professional Excellence at the Carlos Alvarez College of Business in 2005. He has taught a variety of courses at both the undergraduate and graduate level, including Business Law, Business Organizations and Commercial Law, Legal Environment of Business, Legal, Social and Ethical Issues in Health Care Management, Managing Human Resources, Principles of Real Estate, Real Estate Law and Social and Ethical Issues in Business.</p>\n<p>From 2006-2008 he was one of the principle faculty members at UTSA working in collaboration with the Ecumenical Center for Religion and Health on the San Antonio Ethics in Business Awards (http://www.ethicsinbusinesssa.org/), which is an annual research project involving Carlos Alvarez College of Business students and San Antonio professionals and organizations. The goal of this project is to show students that there are still strong ethical business practices occurring within business, and more specifically, within the San Antonio business community.</p>\n<p>Professor Teske is the faculty advisor for two student organizations: Real Estate Entrepreneurs and Leaders and Alpha Kappa Psi.</p>\n<p>Professor Teske is a licensed attorney in Texas and has an applied emphasis on transactional real estate law, real estate closings, title curative matters and business start-ups. He is also a licensed real estate broker in Texas as well.</p>\n<h3><strong>Research Interests</strong></h3>\n<p>Professor Teske&#8217;s research interests primarily focus on pedagogical applications of business law and real estate related issues.</p>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li><strong>&#8220;</strong>I’m in the Band, Now What Do I Do? An Analysis and Application of Business Law Principles to the Formation and Operation of a Band,” with R. Sandoval and L. A. Bruner,<em> Southern Journal of Business and Ethics</em>, Vol. 3, 2011, p. 87.</li>\n<li>&#8220;Warning:  Authorized Use of This Product As Intended Will Render It Useless and Result in Criminal and/or Civil Prosecution&#8230; Maybe,&#8221; withC. R. A. Hallam and R. Sandoval,  <em>Southern Law Journal,</em> Vol. 21, 2011, p. 71.</li>\n<li>&#8220;The Gray Box: An Organizational Decision-Making Tool for Inclusive Ethics Considerations in Strategic Business Issues and Analysis,” withC. R. A. Hallam, <em>Southern Journal of Business and Ethics</em>, Vol. 1, 2009, p. 114.</li>\n</ul>\n",
        "department": [
            "real estate finance and development program",
            "finance"
        ],
        "roles": [
            "faculty",
            "faculty"
        ]
    },
    "1714": {
        "first_name": "Thomas",
        "last_name": "Thomson",
        "faculty_title": "Quincy Lee Professor in Real Estate and Finance",
        "faculty_email": "Thomas.Thomson@utsa.edu",
        "faculty_phone": "210-458-5306",
        "faculty_fax": "210-458-6320",
        "faculty_office_number": "BB 4.06.26",
        "faculty_pdf": 1735,
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Finance",
                "role": "Faculty"
            },
            {
                "department": "Real Estate Finance and Development Program",
                "role": "Faculty"
            }
        ],
        "uri": "thomas-thomson",
        "fullname": "Thomas  A. Thomson, Ph.D.",
        "id": 1714,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/thomas-thomson/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1714",
        "media": [
            {
                "id": 1736,
                "alt": "Thomas Thomson",
                "path": "uploads/2017/11/ThomasThomson.jpg",
                "correctedPath": "faculty/headshots/real-estate-finance-and-development-program/1714-thomas-thomson.jpg"
            }
        ],
        "topd": "Real Estate Finance and Development Program",
        "dslug": "real-estate-finance-and-development-program",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. University of Michigan, Ann Arbor</li>\n<li>Ph.D. University of California, Berkeley</li>\n<li>M.S. Virginia Polytechnic Institute and State University</li>\n<li>B.S.F. University of British Columbia</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Professor Thomson is the Quincy Lee Distinguished Professor of Real Estate and Finance in the Carlos Alvarez College of Business at The University of Texas, San Antonio. He is also the research coordinator of the Real Estate Finance and Development Program. His teaching includes Real Estate Finance and Real Estate Investment at both the graduate and undergraduate level, Principles of Real Estate, Investments, and Principles of Corporate Finance. He is a recipient of the Carlos Alvarez College of Business faculty award for Overall Faculty Excellence, for Research, for Academic Service and for Community Service. He is a member of the American Real Estate and Urban Economics Association, The American Real Estate Society, The Urban Land Institute, CCIM, and the International Facility Management Association. He is the faculty advisor for the Roadrunner Wesley student organization.</p>\n<p>Prior to joining the UTSA faculty Dr. Thomson held faculty positions at the University of Michigan and the University of Illinois as well as working professionally for Fortune 500 companies. He is a Canadian by birth (a native of Vancouver Island, British Columbia) and American via naturalization.</p>\n<h3><strong>Research Interests</strong></h3>\n<ul>\n<li>Real estate finance including mortgage default, foreclosures and subprime mortgages</li>\n<li>Real estate brokerage, manufactured housing and the value of green in real estate</li>\n</ul>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li>&#8220;An Empirical Assessment of the Value of Green in Residential Real Estate,&#8221; (with A. Cadena), <em>The Appraisal Journal</em>, Vol. 83, Winter 2015, pp. 32-40</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/ZillowEstimateApprJourn2010.pdf\">Zillow&#8217;s Estimates of Single-Family Housing Values</a>,&#8221; with D. Hollas and R. Rutherford,<em>The Appraisal Journal, </em>Vol. 78, Winter 2010, pp 26-32.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/AllenRutherfordThomsonAskingRentsJRFE2009.pdf\">Residential Asking Rents and Time on the Market</a>,&#8221; with M. Allen, and R. Rutherford, <em>The Journal of Real Estate Finance and Economics, </em>Vol. 38, No. 4, 2009, pp. 351-365.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/Thomson_JREFE2006_33_241-258.pdf\">Subprime Transitions: Lingering or Malingering in Default</a>,&#8221; with D. Capozza, <em>The Journal of Real Estate Finance and Economics, </em>Vol. 33, No. 3, 2006, pp. 240-258.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/Property%20Assessments%20and%20Information%20Asymmetry%20in%20Residential%20Real%20Estate%20JRER%202006.pdf\">Property Assessments and Information Asymmetry in Real Estate,</a>&#8221; with F. Firozzi, D. Hollas and R. Rutherford, <em>Journal of Real Estate Research</em>, Vol. 28, No. 3, 2006, pp. 275-291.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/CapozzaIsraelsenThomsonREE.V33.3.4.pdf\">Appraisal, Agency and Atypicality: Evidence From Manufactured Homes</a>,&#8221; with D. Capozza and R. Israelsen, <em>Real Estate Economics</em>, Vol. 33, No. 3, 2005, pp. 509-537.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/Optimal_Stopping_Capozza_Thomson_2005.pdf\">Optimal Stopping and Losses on Subprime Mortgages,</a>&#8221; with D. Capozza, <em>The Journal of Real Estate Finance and Economics,</em> Vol. 30, No. 2, 2005, pp. 115-131.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/McMurrayThomsonRace&amp;MortgageCloseJRR2003.pdf\">The Influence of Race in Residential Mortgage Closings,</a>&#8221; with J. McMurray, <em>The Journal of Real Estate Research, </em>Vol. 25, No. 4, 2003, pp. 543-556.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/Real_Estate_AgentRemarksJRER20_205_215.pdf\">Real Estate Agent Remarks: Help or Hype?,</a>&#8221; wit J. Haig and R. Rutherford, <em>Journal of Real Estate Research</em>, Vol. 20, No. 1-2, 2000, pp. 205-215.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/CapozzaKazarianThomson_ConditionalREE.V26.3.1.pdf\">The Conditional Probability of Mortgage Default</a>,&#8221; with D. Capozza and D. Kazarian, <em>Real Estate Economics (AREUEA Journal), </em>Vol. 26, No. 3, 1998, pp. 259-289.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/CapozzaKazarianThomsonLocalREE.V25.4.6.pdf\">Mortgage Default in Local Markets</a>,&#8221; with D. Capozza and D. Kazarian, <em>Real Estate Economics (AREUEA Journal), </em>Vol. 25, No. 4, 1997, pp. 631-655.</li>\n<li>&#8220;<u><a href=\"http://faculty.business.utsa.edu/tthomson/papers/ThomsonMcMurrayClosingProbJRERv14p055.pdf\">Determinants of the Closing Probability of Residential Mortgages</a>,&#8221; </u>with J. McMurray, <em>Journal of Real Estate Research</em>, Vol. 14, No. 1-2, 1997, pp. 55-64.</li>\n<li><u>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/Thomson_TimberInvestments.pdf\">Long Term Portfolio Returns From Timber and Financial Assets</a>,&#8221; </u><em>Journal of Real Estate Portfolio Management, </em>Vol. 3, No<strong>. </strong>1, 1997, pp. 57-73.</li>\n<li>&#8220;<a href=\"http://faculty.business.utsa.edu/tthomson/papers/Thomson_TimberRotation1.pdf\">Optimal Forest Rotation When Stumpage Prices Follow a Diffusion</a>,&#8221; <em>Land Economics, </em>Vol. 68, No. 3, 1992, pp. 329-342.</li>\n<li>&#8220;Efficient Combinations of Timber and Financial Market Investments in Single Period and Multiperiod Portfolios,&#8221; <em>Forest Science, </em>Vol. 37, No. 2, 1991, pp. 41-480.</li>\n</ul>\n",
        "department": [
            "finance",
            "real estate finance and development program"
        ],
        "roles": [
            "faculty",
            "faculty"
        ]
    },
    "1779": {
        "first_name": "Robert",
        "last_name": "Wehrmeyer",
        "faculty_title": "Lecturer in Finance",
        "faculty_email": "robert.wehrmeyer@utsa.edu",
        "faculty_phone": "210-458-7333",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.30",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Real Estate Finance and Development Program",
                "role": "Faculty"
            },
            {
                "department": "Finance",
                "role": "Faculty"
            }
        ],
        "uri": "robert-wehrmeyer",
        "fullname": "Robert Wehrmeyer, J.D.",
        "id": 1779,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/robert-wehrmeyer/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1779",
        "media": [],
        "topd": "Real Estate Finance and Development Program",
        "dslug": "real-estate-finance-and-development-program",
        "content": "",
        "department": [
            "real estate finance and development program",
            "finance"
        ],
        "roles": [
            "faculty",
            "faculty"
        ]
    },
    "1815": {
        "first_name": "Nicole",
        "last_name": "Beebe",
        "faculty_title": "Melvin Lachman Endowed Chair <br/> Professor of Information Systems and Cyber Security",
        "faculty_email": "nicole.beebe@utsa.edu",
        "faculty_phone": "210-458-6301",
        "faculty_fax": "210-458-6305",
        "faculty_office_number": "NPB 5.102N",
        "faculty_pdf": 12804,
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Information Systems and Cyber Security",
                "role": "Faculty"
            },
            {
                "department": "Cyber Center for Security and Analytics",
                "role": "Faculty"
            }
        ],
        "uri": "nicole-beebe",
        "fullname": "Nicole Beebe, Ph.D.",
        "id": 1815,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/nicole-beebe/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1815",
        "media": [
            {
                "id": 1821,
                "alt": "Nicole Beebe",
                "path": "uploads/2017/11/NicoleBeebe-e1533310876529.jpg",
                "correctedPath": "faculty/headshots/cyber-center-for-security-and-analytics/1815-nicole-beebe.jpg"
            }
        ],
        "topd": "Cyber Center for Security and Analytics",
        "dslug": "cyber-center-for-security-and-analytics",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. The University of Texas at San Antonio</li>\n<li>MS Georgia State University</li>\n<li>BS Michigan Technological University</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Nicole L. Beebe holds a Ph.D. in business administration with a concentration in information technology from The University of Texas at San Antonio, an MS in criminal justice from Georgia State University and a BS in electrical engineering from Michigan Technological University.  She has over fifteen years of industry and government experience in information security and digital forensics.  She was a computer crime investigator for the U.S. Air Force Office of Special Investigations from 1998-2007.  She has been a Certified Information Systems Security Professional (CISSP) since 2001, is a licensed private investigator in the state of Texas and holds three professional certifications in digital forensics (CCFP, EnCE, ACE).</p>\n<p>Professor Beebe’s research interests include intelligent digital forensics recovery and retrieval techniques, the use of data mining and machine learning techniques to solve information security problems and strategic decision making involving organizational information security management.  Her research has appeared in numerous journals, including <em>Decision Support Systems (DSS), IEEE Transactions on Information Forensics and Security<strong>, </strong>Communications of the AIS (CAIS), The DATABASE for Advances in Information Systems, Digital Investigation </em>and the<em> Journal of Information System Security (JISSEC)</em>.  She has published several book chapters in the <em>Advances in Digital Forensics</em> series.</p>\n<p>Professor Beebe serves annually on several top-tier, international digital forensics conferences.  She serves on the board of directors for the American Society of Digital Forensics &amp; eDiscovery and is a member of several professional organizations, including the American Academy of Forensic Sciences and the Information Systems Security Association, among many others.<br />\n<div id=\"buzzsprout-player-12769262\"></div>\n      <script src=\"https://www.buzzsprout.com/2166254/12769262.js?container_id=buzzsprout-player-12769262&amp;player=small\" type=\"text/javascript\" charset=\"utf-8\"></script>\n      \n<h3><strong>Research Interests</strong></h3>\n<ul>\n<li>Digital forensics (media and network intrusion forensics; intelligent forensic algorithms)</li>\n<li><a href=\"http://business.utsa.edu/programs/cyber-security\">Cyber security</a> (behavioral, managerial and technical issues)</li>\n<li>Data Analytics (cyber analytics; computational forensics)</li>\n</ul>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li>“Data Type Classification: Hierarchical Class-to-Type Modeling,” in <em>Advances in Digital Forensics XII</em>, Boston: Springer, 2016, pp. 325-343.</li>\n<li>“An Empirical Examination of an Agile Contingent Project /Method Fit Model,” <em>Communications of the Association for Information Systems</em>. Vol. 39, No. 1, 2016, pp. 267-296.</li>\n<li>“Ranking Publication Outlets for Information Security Research,” (with Jan Clark, Frederick Chang and Priya Padmanabhan), <em>Journal of Information System</em> <em>Security</em>, Vol. 10, No. 2, 2015, pp. 37-57.</li>\n<li>“Sceadan: Using Concatentated N-Gram Vectors for Improved Data/File Type Classification,” with Laurence A. Maddox, Lishu Liu and Minghe Sun, <em>IEEE Transactions on Information Forensics and Security</em>, (8:9), pp. 1519-1530.</li>\n<li>“Post-Retrieval Search Hit Clustering to Improve Information Retrieval Effectiveness: A Digital Forensics Case Study,” with Jan Guynes Clark, Glenn B. Dietrich, Myung S. Ko and Daijin Ko, <em>Decision Support Systems (DSS)</em>, Vol. 51, Issue 4, 2011, pp. 732-744.</li>\n<li>“Improving Organizational Information Security Strategy via Meso-Level Application of Situational Crime Prevention to the Risk Management Process,” with V. Srinivasan Rao, <em>Communications of the Association for Information Systems (CAIS)</em>, Vol. 26, Issue 17, 2010, pp. 329-358.</li>\n<li>“Digital Forensic Research: The Good, The Bad, and The Unaddressed,” in <em>Advances in Digital Forensics V, </em>G. Peterson and S. Shenoi (eds.), Boston: Springer, 2009, pp. 17-33.</li>\n<li>“Digital Forensic Implications of ZFS,” with Sonia Stacy and Dane Stuckey, <em>Digital Investigation, </em>Vol. 6, Issue 1, 2009, pp. 99-107.</li>\n<li>“Examination of Organizational Information Security: A Pilot Study,” with V. Srinivasan Rao, <em>Proceedings of the Fifteenth Americas Conference on Information Systems</em>, San Francisco, California, 200.</li>\n<li>“Digital Forensic Text String Searching: Improving Information Retrieval Effectiveness by Thematically Clustering Search Results,” with Jan Guynes Clark, <em>Digital Investigation, </em>Vol.4, Issue 1, 2007, pp. 49-54.</li>\n<li>“A New Process Model for Text String Searching,” with Glenn Dietrich, in IFIP International Federation for Information Processing, <em>Advances in Digital Forensics III, </em>P. Craiger and S. Shenoi (eds.), Boston: Springer, Volume 242, 2007, pp. 179-191.</li>\n<li>“A Discriminant Model for Predicting Hacker Behavior,” with Jan Guynes Clark, <em>Journal of Information System Security, </em>Vol. 3, Issue 3, 2007, pp. 3-20.</li>\n<li>“Moral Intensity and Ethical Decision-Making: A Contextual Extension,” with Tim Goles, Greg White, Alberto Dorantes and Barbara Hewitt<em> , The</em> <em>DATA BASE for Advances in Information Systems</em>, Vol. 37, Issues 2-3, 2007, pp. 86-95<em>.</em></li>\n<li>“A Hierarchical, Objectives-Based Framework for the Digital Investigations Process,” with Jan Guynes Clark, <em>Digital Investigation,</em> Vol. 2, Issue 2, 2005, pp. 146-166.</li>\n<li>“Dealing with Terabyte Datasets in Digital Investigations,” with Jan Guynes Clark , in <em>Research Advances in Digital Forensics,</em> M. Pollitt and S. Shenoi (eds.), Springer, Norwell, 2005<em>.</em></li>\n</ul>\n",
        "department": [
            "information systems and cyber security",
            "cyber center for security and analytics"
        ],
        "roles": [
            "faculty",
            "faculty"
        ]
    },
    "1816": {
        "first_name": "Kim-Kwang Raymond",
        "last_name": "Choo",
        "faculty_title": "Professor & Cloud Technology Endowed Professorship<br> Assistant Department Chair of ISCS",
        "faculty_email": "Raymond.Choo@utsa.edu",
        "faculty_phone": "210-458-7876",
        "faculty_fax": "",
        "faculty_office_number": "NPB 3.356",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Information Systems and Cyber Security",
                "role": "Administrators"
            }
        ],
        "uri": "kim-kwang-raymond-choo",
        "fullname": "Kim-Kwang Raymond Choo, Ph.D.",
        "id": 1816,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/kim-kwang-raymond-choo/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/1816",
        "media": [
            {
                "id": 6392,
                "alt": "Raymond Choo",
                "path": "uploads/2017/11/raymond_choo.jpg",
                "correctedPath": "faculty/headshots/doctoral-studies/1816-kim-kwang-raymond-choo.jpg"
            }
        ],
        "topd": "Doctoral Studies",
        "dslug": "doctoral-studies",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. Queensland University of Technology</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-15842 alignnone\" src=\"http://business.utsa.edu/wp-content/uploads/2017/11/Raymond_Choo_RibbonGraphic-127x150.png\" alt=\"Highly Cited Research 2020\" width=\"90\" height=\"106\" /><br />\n<a href=\"https://recognition.webofscience.com/awards/highly-cited/2020/\" target=\"_blank\" rel=\"noopener noreferrer\">Highly-Cited Researcher in the Field of Cross-Field-2020</a><br />\n<img decoding=\"async\" loading=\"lazy\" class=\"wp-image-19982 alignnone\" src=\"http://business.utsa.edu/wp-content/uploads/2017/11/Raymond-Choo-citation-ribbon_2021.png\" alt=\"Highly Cited Researcher 2021\" width=\"86\" height=\"118\" /><br />\n<a href=\"https://recognition.webofscience.com/awards/highly-cited/2021/\">Highly-Cited Researcher in the Field of Computer Science-2021</a></p>\n<h5><a href=\"https://sites.google.com/site/raymondchooau/\">Personal Faculty Website</a></h5>\n<h5><a href=\"https://www.acm.org/articles/people-of-acm/2021/raymond-choo\">People of ACM Profile</a></h5>\n<p><strong>Kim-Kwang Raymond Choo</strong> graduated with a Ph.D. in information technology from Queensland University of Technology, Australia, and holds the Cloud Technology Endowed Professorship at UTSA. Earlier in his career, Raymond worked for the Singapore Police Force, the Australian Government’s Australian Institute of Criminology, and the University of South Australia. He was also a visiting scholar at Australian National University’s School of Regulation and Global Governance, a visiting expert at INTERPOL Global Complex for Innovation in 2015, a visiting Fulbright scholar at Rutgers University’s School of Criminal Justice and at Palo Alto Research Center in 2009, and an Honorary Commander, 502nd Air Base Wing, Joint Base San Antonio-Fort Sam Houston, from 2017 to 2019.</p>\n<p>He is the founding co-Editor-in-Chief of <em>ACM Distributed Ledger Technologies: Research &amp; Practice</em>, and founding Chair of IEEE Technology and Engineering Management Society (TEMS)’s Technical Committee on Blockchain and Distributed Ledger Technologies. He currently serves as an Advisory Council Member of the Anti-Human Trafficking Intelligence Initiative (a 501(c)3 US-based nonprofit, aims to disrupt the market of human trafficking, child exploitation, and child sexual abuse material), and is an Adjunct Professor (Courtesy Appointment) at the University of South Australia and Singapore University of Technology and Design.</p>\n<p>He is an ACM Distinguished Speaker and IEEE Computer Society Distinguished Visitor (2021 – 2023). In 2015 he and his team won the Digital Forensics Research Challenge organized by Germany’s University of Erlangen-Nuremberg. He is the recipient of the 2022 IEEE Hyper-Intelligence TC Award for Excellence in Hyper-Intelligence Systems (Technical Achievement award), the 2022 IEEE TC on Homeland Security Research and Innovation Award, the 2022 IEEE TC on Secure and Dependable Measurement Mid-Career Award, and the 2019 IEEE TC on Scalable Computing Award for Excellence in Scalable Computing (Middle Career Researcher). He has also received best paper awards from IEEE Systems Journal in 2021, IEEE Computer Society’s Bio-Inspired Computing Special Technical Committee Outstanding Paper Award for 2021, IEEE DSC 2021, IEEE Consumer Electronics Magazine for 2020, Journal of Network and Computer Applications for 2020, EURASIP Journal on Wireless Communications and Networking in 2019, IEEE TrustCom 2018, and ESORICS 2015, and Best Student Paper Awards from Inscrypt 2019 and ACISP 2005.</p>\n<p>He also has two granted regular U.S. patent applications on lightweight cryptographic scheme for mobile devices.</p>\n<p><strong>Research Interests</strong></p>\n<ul>\n<li>Big data analytics, including privacy-preserving analytics</li>\n<li>Blockchain and distributed ledger technology</li>\n<li>Cyber security</li>\n<li>Digital forensics, including forensics-by-design</li>\n</ul>\n<p>His research has been funded by funding agencies in</p>\n<ul>\n<li>S.: NASA, National Security Agency, National Science Foundation, U.S. Department of Defense, U.S. Office of Juvenile Justice and Delinquency, CPS Energy, LGS Innovations, MITRE, Texas National Security Network Excellence Fund; and</li>\n<li>Australia: National Health and Medical Research Council, Australian Government National Drug Law Enforcement Research Fund, Australian Government Cooperative Research Centre for Data to Decision, Lockheed Martin Australia, auDA Foundation, Government of South Australia, BAE Systems stratsec, Australasian Institute of Judicial Administration Incorporated, Australian Research Council</li>\n</ul>\n<p>His research has been widely cited, including in government reports of the Australian Government, United Nations Office on Drugs and Crime (UNODC), U.S. CRS Report for Congress (Prepared for Members and Committees of Congress), International Centre for Missing &amp; Exploited Children, International Telecommunication Union (ITU), and UK Home Office. One of his published cryptographic protocols was included in two independent submissions to the IEEE 802.11, the working group setting the standards for wireless LANs, by computer scientists from Fujitsu Labs in America; and the IETF / Network Working Group by a team of computer scientists from Tropos Networks (U.S.), Toshiba, Huawei, and University of Murcia. Another of his published protocol was used in the P2P solution of the Milagro TLS (pairing-based cryptography for Transport Layer Security) presented to the IETF by researchers from MIRACL Ltd in 2016. His published design principle about how session keys should be constructed in cryptographic (key establishment) protocols that result in significant benefits for their security was cited in a special publication (SP 800-56A) – Recommendation for Pair-Wise Key Establishment Schemes Using Discrete Logarithm Cryptography – by the U.S. National Institute of Standards and Technology, as well as the subsequent versions (Revision 2, 2013, and Revision 3, April 2018).</p>\n",
        "department": [
            "information systems and cyber security"
        ],
        "roles": [
            "administrators"
        ]
    },
    "2321": {
        "first_name": "Bruce",
        "last_name": "Rudy",
        "faculty_title": "Associate Professor of Management",
        "faculty_email": "bruce.rudy@utsa.edu",
        "faculty_phone": "210-458-4318",
        "faculty_fax": "",
        "faculty_office_number": "BB 1.01.20",
        "faculty_pdf": 12805,
        "faculty_additional_info": "<strong>Associate Professor </strong>\r\nDepartment of Management",
        "department_role_repeater": [
            {
                "department": "Management",
                "role": "Faculty"
            }
        ],
        "uri": "bruce-rudy",
        "fullname": "Bruce C. Rudy, Ph.D.",
        "id": 2321,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/bruce-rudy/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/2321",
        "media": [
            {
                "id": 21336,
                "alt": "Bruce Rudy",
                "path": "uploads/2017/11/Bruce-Rudy-Bio-Pic.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/2321-bruce-rudy.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<h3><b>Degrees</b></h3>\n<ul>\n<li>Ph.D. University of Texas at Austin</li>\n<li>M.S. University of Texas at Austin</li>\n<li>M.S. University of Michigan</li>\n<li>B.B.A. University of Texas at Austin</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Dr. Bruce Rudy is a University of Texas System Regents’ Outstanding Teaching Award winner and associate professor of strategy in the Department of Management at the University of Texas at San Antonio. He joined the UTSA faculty in 2011 after completing his Ph.D. in Strategic Management at the University of Texas at Austin. His undergraduate and master’s degrees are also from the University of Texas at Austin. Additionally, he holds a master’s degree from the University of Michigan.</p>\n<p>Dr. Rudy is the former senior executive and faculty director for the Center for Professional Excellence (CPE) at UTSA’s Carlos Alvarez College of Business. Under his four years of leadership, the CPE developed a variety of new executive education offerings including customized programs with UT Health-San Antonio and USAA. During this time, Dr. Rudy pioneered the Discover, Discuss, Do andragogical framework that led to the redesigning of the Executive MBA curriculum. After implementing this learning framework, the EMBA achieved its first ever ranking in CEO Magazine’s top Global EMBA programs where it is currently ranked 8<sup>th</sup>.</p>\n<p>Dr. Rudy research focuses in the areas of learning and development, corporate political activity, and corporate social responsibility. Regarding learning and development, his work explores techniques and best practices to improve student learning outcomes. Regarding corporate political activity, his work considers the motivations that drive firms to invest in government relations (i.e., lobbying, political contributions) and the performance outcomes of such investments. Regarding corporate social responsibility, his research focuses on the impact of CSR investments on the firm’s stakeholders and its long-term performance.</p>\n<p>His research has been published in Journal of Management, Global Strategy Journal, Business &amp; Society, Harvard Business Review and California Management Review.</p>\n<h3><strong>Research Interests</strong></h3>\n<ul>\n<li>Learning and Development</li>\n<li>Corporate Social Responsibility</li>\n<li>Corporate Political Activity</li>\n</ul>\n<h3><strong>Selected Publications</strong></h3>\n<div class=\"off-canvas-wrapper\">\n<div class=\"off-canvas-content\" data-off-canvas-content=\"\">\n<div id=\"content\">\n<div id=\"inner-content\" class=\"row expanded\">\n<div class=\"content-wrap\">\n<article id=\"post-1008\" class=\"post-1008 page type-page status-publish hentry\" role=\"article\">\n<section class=\"entry-content\">\n<ul>\n<li>Build Learning into Your Employees&#8217; Workflow,&#8221; Harvard Business Review, July 2022 <a href=\"https://hbr.org/2022/07/build-learning-into-your-employees-workflow\">(https://hbr.org/2022/07/build-learning-into-your-employees-workflow)</a></li>\n<li>“Enron and the Energy Transition to Renewables,” <em>California Management Review Insight</em>, January, 2022 (<a href=\"https://cmr.berkeley.edu/2022/01/enron-and-the-energy-transition-to-renewables/\">https://cmr.berkeley.edu/2022/01/enron-and-the-energy-transition-to-renewables/</a>).</li>\n<li>&#8220;Attack or Defend? The Role of Institutional Context on Patent Litigation Strategies,&#8221; (with S.L. Black), <em>Journal of Management</em>, Vol. 44, No. 3, 2018, pp. 1226-1249.</li>\n<li>“Performance, Aspirations and Market Versus Nonmarket Investment,” (with A.F. Johnson), <em>Journal of Managemen</em>t, Vol. 42, No. 4, 2016, pp. 936-959.</li>\n<li>“Revisiting FDI Strategies and the Flow of Firm‐specific Advantages: A Focus on State‐owned Enterprises,” (with S.R. Miller and D. Wang), <em>Global Strategy</em> <em>Journal,</em> Vol. 6, No. 1, 2016, pp. 69-78.</li>\n</ul>\n</section>\n</article>\n</div>\n</div>\n</div>\n</div>\n</div>\n",
        "department": [
            "management"
        ],
        "roles": [
            "faculty"
        ]
    },
    "2330": {
        "first_name": "Cerise",
        "last_name": "Edmonds",
        "faculty_title": "Interim Executive Director of the Center for Professional Excellence ",
        "faculty_email": "cerise.edmonds@utsa.edu",
        "faculty_phone": "210-458-7415",
        "faculty_fax": "210-458-4873",
        "faculty_office_number": "BB 1.01.20F",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Center for Professional Excellence",
                "role": "Administrators"
            },
            {
                "department": "Executive MBA",
                "role": "Staff"
            }
        ],
        "uri": "cerise-edmonds",
        "fullname": "Cerise Edmonds",
        "id": 2330,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/cerise-edmonds/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/2330",
        "media": [
            {
                "id": 4734,
                "alt": "Cerise Edmonds",
                "path": "uploads/2017/11/cerise_edmonds.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/2330-cerise-edmonds.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "",
        "department": [
            "center for professional excellence",
            "executive mba"
        ],
        "roles": [
            "administrators",
            "staff"
        ]
    },
    "2970": {
        "first_name": "Rosa",
        "last_name": "Garza-Girdy",
        "faculty_title": "Assistant Dean of Student Services",
        "faculty_email": "Rosa.Garza1@utsa.edu",
        "faculty_phone": "210-458-2200",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Administrators"
            }
        ],
        "uri": "rosa-e-garza-girdy",
        "fullname": "Rosa E. Garza-Girdy, J.D.",
        "id": 2970,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/rosa-e-garza-girdy/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/2970",
        "media": [
            {
                "id": 7715,
                "alt": "Rosa Garza-Girdy",
                "path": "uploads/2018/12/rosa_garzagirdy.jpg",
                "correctedPath": "faculty/headshots/undergraduate-studies/2970-rosa-e-garza-girdy.jpg"
            }
        ],
        "topd": "Undergraduate Studies",
        "dslug": "undergraduate-studies",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "administrators"
        ]
    },
    "4343": {
        "first_name": "Jim",
        "last_name": "Aviles",
        "faculty_title": "Student Development Specialist",
        "faculty_email": "james.aviles@utsa.edu",
        "faculty_phone": "210-458-7315",
        "faculty_fax": "210-458-4398",
        "faculty_office_number": "BB 4.01.18",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Graduate Studies",
                "role": "Staff"
            }
        ],
        "uri": "jim-aviles",
        "fullname": "Jim Aviles",
        "id": 4343,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jim-aviles/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4343",
        "media": [
            {
                "id": 23429,
                "alt": "Image of Jim Aviles",
                "path": "uploads/2022/10/James-Aviles-Square.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/4343-jim-aviles.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "<p>Graduate Advisor for:</p>\n<ul>\n<li>Master of Accountancy and 150-hour program</li>\n<li>MS IT</li>\n<li>Graduate Certificates:\n<ul>\n<li>Cloud Computing</li>\n<li>Cyber Security</li>\n</ul>\n</li>\n</ul>\n",
        "department": [
            "graduate studies"
        ],
        "roles": [
            "staff"
        ]
    },
    "4357": {
        "first_name": "Jo Anna",
        "last_name": "Caballero",
        "faculty_title": "Academic Advisor II",
        "faculty_email": "joanna.caballero@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "jo-anna-caballero",
        "fullname": "Jo Anna Caballero",
        "id": 4357,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jo-anna-caballero/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4357",
        "media": [
            {
                "id": 10527,
                "alt": "Jo Anna Caballero",
                "path": "uploads/2018/03/A-JC-2-JoAnna-Caballero-e1570803405277.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/4357-jo-anna-caballero.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4363": {
        "first_name": "Heather",
        "last_name": "Castro",
        "faculty_title": "Academic Advisor IV",
        "faculty_email": "heather.castro@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "heather-castro",
        "fullname": "Heather Castro",
        "id": 4363,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/heather-castro/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4363",
        "media": [],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4370": {
        "first_name": "Annette",
        "last_name": "Cox",
        "faculty_title": "Senior Administrative Associate",
        "faculty_email": "annette.cox@utsa.edu",
        "faculty_phone": "210-458-7039",
        "faculty_fax": "210-458-7040",
        "faculty_office_number": "BB 4.03.54",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "annette-cox",
        "fullname": "Annette Cox",
        "id": 4370,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/annette-cox/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4370",
        "media": [
            {
                "id": 4372,
                "alt": "Annette Cox",
                "path": "uploads/2018/03/Annette_Cox.jpg",
                "correctedPath": "faculty/headshots/office-of-faculty-success-and-research/4370-annette-cox.jpg"
            }
        ],
        "topd": "Office of Faculty Success and Research",
        "dslug": "office-of-faculty-and-research",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "4373": {
        "first_name": "Jim",
        "last_name": "Cox",
        "faculty_title": "Interim Assistant Dean for Fiscal Administration<br>Fiscal Manager <br> Lecturer in Accounting",
        "faculty_email": "jimmie.cox@utsa.edu",
        "faculty_phone": "210-458-8098",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Administrators"
            },
            {
                "department": "Accounting",
                "role": "Faculty"
            },
            {
                "department": "Center for Professional Excellence",
                "role": "Staff"
            }
        ],
        "uri": "jim-cox",
        "fullname": "Jim Cox, CPA",
        "id": 4373,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jim-cox/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4373",
        "media": [
            {
                "id": 4578,
                "alt": "Jim Cox",
                "path": "uploads/2018/03/jimmy_cox.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/4373-jim-cox.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "",
        "department": [
            "business service center",
            "accounting",
            "center for professional excellence"
        ],
        "roles": [
            "administrators",
            "faculty",
            "staff"
        ]
    },
    "4380": {
        "first_name": "Shelly",
        "last_name": "Dotson",
        "faculty_title": "Assistant to the Dean",
        "faculty_email": "shelly.dotson",
        "faculty_phone": "210-458-7337",
        "faculty_fax": "210-458-4308",
        "faculty_office_number": "BB 4.01.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "shelly-dotson",
        "fullname": "Shelly Dotson",
        "id": 4380,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/shelly-dotson/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4380",
        "media": [
            {
                "id": 26221,
                "alt": "Shelly Dotson",
                "path": "uploads/2018/03/MicrosoftTeams-image.jpg",
                "correctedPath": "faculty/headshots/deans-office/4380-shelly-dotson.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "4383": {
        "first_name": "Amy",
        "last_name": "Flack",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "amy.flack@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "amy-flack",
        "fullname": "Amy Flack",
        "id": 4383,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/amy-flack/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4383",
        "media": [],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4384": {
        "first_name": "Charlie",
        "last_name": "Fraga",
        "faculty_title": "Academic Advisor II",
        "faculty_email": "charles.fraga@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "charlie-fraga",
        "fullname": "Charlie Fraga",
        "id": 4384,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/charlie-fraga/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4384",
        "media": [
            {
                "id": 9874,
                "alt": "Charles Fraga",
                "path": "uploads/2018/03/Charles_Fraga.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/4384-charlie-fraga.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4386": {
        "first_name": "Wendy",
        "last_name": "Frost",
        "faculty_title": "Director of Communications",
        "faculty_email": "wendy.frost@utsa.edu",
        "faculty_phone": "210-458-7313",
        "faculty_fax": "210-458-4308",
        "faculty_office_number": "BB 4.01.08",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "wendy-frost",
        "fullname": "Wendy Frost",
        "id": 4386,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/wendy-frost/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4386",
        "media": [
            {
                "id": 4387,
                "alt": "Wendy Frost",
                "path": "uploads/2018/03/Wendy_Frost.jpg",
                "correctedPath": "faculty/headshots/deans-office/4386-wendy-frost.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "4388": {
        "first_name": "Leticia",
        "last_name": "Garcia",
        "faculty_title": "Assistant Director of Student Success",
        "faculty_email": "leticia.garcia@utsa.edu",
        "faculty_phone": "210-458-6923",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "leticia-garcia",
        "fullname": "Leticia Garcia",
        "id": 4388,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/leticia-garcia/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4388",
        "media": [
            {
                "id": 4766,
                "alt": "Leticia Garcia",
                "path": "uploads/2018/03/leticia_garcia.jpg",
                "correctedPath": "faculty/headshots/student-success-center/4388-leticia-garcia.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "4390": {
        "first_name": "James",
        "last_name": "Gerhardt",
        "faculty_title": "Academic Advisor III",
        "faculty_email": "james.gerhardt@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "james-gerhardt",
        "fullname": "James Gerhardt",
        "id": 4390,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/james-gerhardt/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4390",
        "media": [
            {
                "id": 9924,
                "alt": "James Gerhardt",
                "path": "uploads/2018/03/James-Gerhardt.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/4390-james-gerhardt.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4391": {
        "first_name": "Laura",
        "last_name": "Gilliland",
        "faculty_title": "Assistant Director",
        "faculty_email": "laura.gilliland@utsa.edu",
        "faculty_phone": "210-458-7333",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.30",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Real Estate Finance and Development Program",
                "role": "Staff"
            }
        ],
        "uri": "laura-gilliland",
        "fullname": "Laura Gilliland",
        "id": 4391,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/laura-gilliland/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4391",
        "media": [
            {
                "id": 18591,
                "alt": "Laura Gilliland",
                "path": "uploads/2018/03/Preferred-Laura-Gilliland-photo-e1627422785435.jpg",
                "correctedPath": "faculty/headshots/real-estate-finance-and-development-program/4391-laura-gilliland.jpg"
            }
        ],
        "topd": "Real Estate Finance and Development Program",
        "dslug": "real-estate-finance-and-development-program",
        "content": "",
        "department": [
            "real estate finance and development program"
        ],
        "roles": [
            "staff"
        ]
    },
    "4405": {
        "first_name": "Cara",
        "last_name": "Jones",
        "faculty_title": "Associate Director of Graduate Studies",
        "faculty_email": "cara.jones@utsa.edu",
        "faculty_phone": "210-458-4641",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.18",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Graduate Studies",
                "role": "Staff"
            }
        ],
        "uri": "cara-jones",
        "fullname": "Cara Jones",
        "id": 4405,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/cara-jones/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4405",
        "media": [
            {
                "id": 23428,
                "alt": "Image of Cara Jones",
                "path": "uploads/2022/10/Cara-Jones-Square.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/4405-cara-jones.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "<p>Graduate Advisor for:</p>\n<ul>\n<li>Dual MBA/MD</li>\n<li>Dual MBA/MPH</li>\n</ul>\n<p><a class=\"btn btnCTA\" href=\"https://calendly.com/cara-jones\" target=\"_blank\" rel=\"noopener noreferrer\">Book a virtual advising session</a></p>\n",
        "department": [
            "graduate studies"
        ],
        "roles": [
            "staff"
        ]
    },
    "4407": {
        "first_name": "Carmen",
        "last_name": "Juarez",
        "faculty_title": "Program Manager of Executive Education",
        "faculty_email": "carmen.juarez@utsa.edu",
        "faculty_phone": "210-458-7403",
        "faculty_fax": "",
        "faculty_office_number": "BB 1.01.20",
        "faculty_pdf": "",
        "faculty_additional_info": "<strong>Program Manager of Executive Education</strong>\r\nCenter for Professional Excellence",
        "department_role_repeater": [
            {
                "department": "Center for Professional Excellence",
                "role": "Staff"
            }
        ],
        "uri": "carmen-juarez",
        "fullname": "Carmen Juarez",
        "id": 4407,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/carmen-juarez/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4407",
        "media": [
            {
                "id": 4731,
                "alt": "Carmen Juarez",
                "path": "uploads/2018/03/carmen_juarez.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/4407-carmen-juarez.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "",
        "department": [
            "center for professional excellence"
        ],
        "roles": [
            "staff"
        ]
    },
    "4412": {
        "first_name": "Melissa",
        "last_name": "Lackey",
        "faculty_title": "Director of Marketing",
        "faculty_email": "melissa.lackey@utsa.edu",
        "faculty_phone": "210-458-8291",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.08",
        "faculty_pdf": "",
        "faculty_additional_info": "<strong>Director of Marketing\r\n</strong>College of Business",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "melissa-lackey",
        "fullname": "Melissa Lackey",
        "id": 4412,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/melissa-lackey/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4412",
        "media": [
            {
                "id": 18579,
                "alt": "",
                "path": "uploads/2021/07/Lackey_Melissa_8950-square.jpg",
                "correctedPath": "faculty/headshots/deans-office/4412-melissa-lackey.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "4423": {
        "first_name": "Tammy",
        "last_name": "McDaniel",
        "faculty_title": "Assistant Director of Graduate Studies",
        "faculty_email": "tammy.mcdaniel@utsa.edu",
        "faculty_phone": "210-458-5946",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.18",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Graduate Studies",
                "role": "Staff"
            }
        ],
        "uri": "tammy-mcdaniel",
        "fullname": "Tammy McDaniel",
        "id": 4423,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/tammy-mcdaniel/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4423",
        "media": [
            {
                "id": 14074,
                "alt": "Tammy McDaniel",
                "path": "uploads/2018/03/Tammy-McDaniel-cropped-e1610574214267.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/4423-tammy-mcdaniel.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "<p>Graduate Advisor for:</p>\n<ul>\n<li>M.S. Data Analytics</li>\n<li>M.S. Statistics and Data Science</li>\n<li>Graduate Certificate:\n<ul>\n<li>Intelligence Studies</li>\n</ul>\n</li>\n</ul>\n<p>&nbsp;</p>\n",
        "department": [
            "graduate studies"
        ],
        "roles": [
            "staff"
        ]
    },
    "4440": {
        "first_name": "Kateri",
        "last_name": "Morales",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "kateri.morales@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "kateri-teri-morales",
        "fullname": "Kateri Morales",
        "id": 4440,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/kateri-teri-morales/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4440",
        "media": [
            {
                "id": 12951,
                "alt": "Image of Kateri Morales",
                "path": "uploads/2018/03/KateriMorales_6769.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/4440-kateri-teri-morales.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4466": {
        "first_name": "Beverly",
        "last_name": "Ostmo",
        "faculty_title": "Academic Advisor IV",
        "faculty_email": "beverly.ostmo@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "beverly-ostmo",
        "fullname": "Beverly Ostmo",
        "id": 4466,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/beverly-ostmo/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4466",
        "media": [
            {
                "id": 12676,
                "alt": "Image of Beverly Ostmo",
                "path": "uploads/2018/03/BevOstmo_6777-e1591133415413.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/4466-beverly-ostmo.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4485": {
        "first_name": "Julio",
        "last_name": "Ramos",
        "faculty_title": "Director of Student Success",
        "faculty_email": "julio.ramos@utsa.edu",
        "faculty_phone": "210-458-4689",
        "faculty_fax": "210-458-6080",
        "faculty_office_number": "BB 2.01.08",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "julio-ramos-mba",
        "fullname": "Julio Ramos",
        "id": 4485,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/julio-ramos-mba/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4485",
        "media": [],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "4487": {
        "first_name": "Melyssa ",
        "last_name": "Ranton",
        "faculty_title": "Academic Advisor III",
        "faculty_email": "melyssa.ranton@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "melyssa-ranton",
        "fullname": "Melyssa Ranton",
        "id": 4487,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/melyssa-ranton/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4487",
        "media": [
            {
                "id": 9889,
                "alt": "",
                "path": "uploads/2018/03/MelyssaRanton_6717-002-e1562948857509.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/4487-melyssa-ranton.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "4503": {
        "first_name": "John",
        "last_name": "Soudah",
        "faculty_title": "Director of Academic Computing",
        "faculty_email": "john.soudah@utsa.edu",
        "faculty_phone": "210-458-4329",
        "faculty_fax": "210-458-4308",
        "faculty_office_number": "BB 3.02.14",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Academic Computing",
                "role": "Administrators"
            },
            {
                "department": "Administration",
                "role": "Staff"
            }
        ],
        "uri": "john-soudah",
        "fullname": "John Soudah",
        "id": 4503,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/john-soudah/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4503",
        "media": [
            {
                "id": 14905,
                "alt": "Image of John Soudah",
                "path": "uploads/2018/03/john-soudah2020.jpg",
                "correctedPath": "faculty/headshots/academic-computing/4503-john-soudah.jpg"
            }
        ],
        "topd": "Academic Computing",
        "dslug": "academic-computing",
        "content": "",
        "department": [
            "academic computing",
            "administration"
        ],
        "roles": [
            "administrators",
            "staff"
        ]
    },
    "4560": {
        "first_name": "Joanne",
        "last_name": "Wright",
        "faculty_title": "Senior Administrative Associate ",
        "faculty_email": "joanne.wright@utsa.edu",
        "faculty_phone": "210-458-4940",
        "faculty_fax": "210-458-4873",
        "faculty_office_number": "BB 1.01.20",
        "faculty_pdf": "",
        "faculty_additional_info": "<strong>Senior Administrative Associate</strong>\r\nCenter for Professional Excellence",
        "department_role_repeater": [
            {
                "department": "Center for Professional Excellence",
                "role": "Staff"
            }
        ],
        "uri": "joanne-wright",
        "fullname": "Joanne Wright",
        "id": 4560,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/joanne-wright/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/4560",
        "media": [
            {
                "id": 25047,
                "alt": "",
                "path": "uploads/2018/03/Joanne-Wright_2022.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/4560-joanne-wright.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "",
        "department": [
            "center for professional excellence"
        ],
        "roles": [
            "staff"
        ]
    },
    "6584": {
        "first_name": "Tracy",
        "last_name": "Martin",
        "faculty_title": "Department Fiscal Specialist",
        "faculty_email": "tracy.martin@utsa.edu",
        "faculty_phone": "210-458-6407",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.03.34",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "tracy-martin",
        "fullname": "Tracy Martin",
        "id": 6584,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/tracy-martin/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6584",
        "media": [
            {
                "id": 9792,
                "alt": "",
                "path": "uploads/2019/06/Tracy-Martin.jpg",
                "correctedPath": "faculty/headshots/business-service-center/6584-tracy-martin.jpg"
            }
        ],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "6585": {
        "first_name": "Lily",
        "last_name": "Wang",
        "faculty_title": "Supervisor of Accounts",
        "faculty_email": "lily.wang@utsa.edu",
        "faculty_phone": "210-458-8063",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.03.34",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "lily-wang",
        "fullname": "Lily Wang",
        "id": 6585,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/lily-wang/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6585",
        "media": [
            {
                "id": 9780,
                "alt": "Lily Wang",
                "path": "uploads/2019/06/lily_wang-e1560961097573.jpg",
                "correctedPath": "faculty/headshots/business-service-center/6585-lily-wang.jpg"
            }
        ],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "6829": {
        "first_name": "Jane",
        "last_name": "Appleby, MD, FACP",
        "faculty_title": "Executive in Residence - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "jane-appleby-md-facp",
        "fullname": "Jane Appleby, MD, FACP",
        "id": 6829,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jane-appleby-md-facp/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6829",
        "media": [
            {
                "id": 6830,
                "alt": "Photo of Dr. Jane Appleby",
                "path": "uploads/2018/08/Appleby-Jane-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6829-jane-appleby-md-facp.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Dr. Jane Appleby, is chief medical officer for Methodist Hospital and Methodist Children’s Hospital, a campus of Methodist Hospital. In this role, Appleby oversees the medical affairs of Methodist Hospital and Methodist Children’s Hospital, as well as championing the patient care delivery system. With over twenty years in practice as an internal medicine doctor, Appleby is board certified in internal medicine and in hospice and palliative medicine. She holds a bachelor of arts from the University of Texas at Austin and earned a doctor of medicine from The University of Texas Health Science Center at San Antonio (UT Health San Antonio), where she also completed her internship and residency in internal medicine. Appleby held the role of chief quality officer for Methodist Healthcare for five years, leading efforts that resulted in unprecedented improvements in quality metrics.</p>\n",
        "department": [],
        "roles": []
    },
    "6831": {
        "first_name": "Ian",
        "last_name": "Thompson III, MD",
        "faculty_title": "Executive in Residence - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "ian-thompson-iii-md",
        "fullname": "Ian Thompson III, MD",
        "id": 6831,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/ian-thompson-iii-md/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6831",
        "media": [
            {
                "id": 6832,
                "alt": "Dr. Ian Thompson III",
                "path": "uploads/2018/08/Thompson-III-Ian-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6831-ian-thompson-iii-md.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Born and raised in San Antonio, Texas, Dr. Ian Thompson III has called San Antonio home for most of his life. A graduate of Keystone school, he completed his undergraduate studies at Texas A&amp;M University and then returned to San Antonio for medical school at The University of Texas Health Science Center at San Antonio (UT Health San Antonio). He completed his general surgery and urologic surgery training at Vanderbilt University in Nashville, TN and then returned to San Antonio to complete a fellowship in urologic oncology at UT Health San Antonio, where he then accepted a faculty position as Assistant Professor in Urologic Oncology. Thompson moved on to open a private practice where his primary focus was providing compassionate, quality care to all of his patients. In 2016, Thompson joined CHRISTUS Santa Rosa Hospital – Medical Center (CSRH – MC) as its Associate Chief Medical Officer.</p>\n",
        "department": [],
        "roles": []
    },
    "6833": {
        "first_name": "Priscilla",
        "last_name": "Hill-Ardoin",
        "faculty_title": "Executive in Residence - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "priscilla-hill-ardoin",
        "fullname": "Priscilla Hill-Ardoin",
        "id": 6833,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/priscilla-hill-ardoin/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6833",
        "media": [
            {
                "id": 6834,
                "alt": "Photo of Priscilla Hill-Ardoin",
                "path": "uploads/2018/08/Hill-Ardoin-Priscilla-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6833-priscilla-hill-ardoin.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Priscilla Hill-Ardoin is founder and president of The Aaron Ardoin Foundation for Sickle Cell Research and Education (AAF). Established in 2005, the AAF is committed to increasing awareness, promoting prevention, enhancing treatment and advancing the cure of sickle cell disease. The foundation serves its mission by awarding grants to non-profit organizations committed to helping those who suffer the scourge of sickle cell disease. Prior to establishing The Aaron Ardoin Foundation, Hill-Ardoin enjoyed a storied career in telecommunications for over 32 years, and is a retired officer of AT&amp;T. Hill-Ardoin has become recognized through the years for her generous charitable work and community service. She is the recipient of numerous awards, among them, the San Antonio Chamber’s Tribute to Women Business Leaders Legacy Award, United Negro College Fund Excellence in Education Award, Voices for Children Super Hero Award, and Girls Inc. Strong Smart and Bold Award, and has been inducted into the Minority Media and Telecom Council Hall of Fame in Washington, D.C.Currently, Hill-Ardoin serves as a director for Enterprise Holdings, Inc., is a trustee for Washington University in St. Louis, a director for Haven for Hope Transformational Center for the Homeless in San Antonio, and external advisory committee member of the Vanderbilt-Meharry-Matthew Walker Center of Excellence in Sickle Cell Disease in Nashville.</p>\n",
        "department": [],
        "roles": []
    },
    "6835": {
        "first_name": "Patricia",
        "last_name": "Diaz Dennis",
        "faculty_title": "Executive in Residence - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "patricia-diaz-dennis",
        "fullname": "Patricia Diaz Dennis",
        "id": 6835,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/patricia-diaz-dennis/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6835",
        "media": [
            {
                "id": 6836,
                "alt": "Photo of Patricia Diaz-Dennis",
                "path": "uploads/2018/08/Diaz-Dennis-Patricia2-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6835-patricia-diaz-dennis.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Patricia Diaz Dennis retired from AT&amp;T in 2008 as Senior Vice President and Assistant General Counsel. She currently serves on two public company boards: Entravision Communications Corporation and Amalgamated Bank. She rejoined Entravision in 2014, after first serving from 2001 to 2005; she chairs its Nominating &amp; Governance Committee. In August 2018, Diaz Dennis joined Amalgamated Bank’s Board, where she chairs the Compensation and Human Resources Committee. Her past board service includes Telemundo, Carr America, UST, Massachusetts Mutual Life Insurance Company and U.S. Steel.</p>\n<p>Diaz Dennis also serves on several not-for-profit boards including chairing the Sanctions Panel for the Global Fund (since 2013). She is currently Vice Chair of the Mind Science Foundation Board of Trustees and served as Chair of the Board of Trustees of the World Affairs Counsel of San Antonio from 2018-20. Diaz Dennis was the first Latina Board Chair of Girl<br />\nScouts of the USA (2005-2008) and served on its board for nine years. She also served on the National Public Radio Board.</p>\n<p>Since Diaz Dennis graduated from law school in 1973, she has achieved many firsts in government, the legal profession, and the communications industry. She was the first woman and Latina lawyer at Paul Hastings, an international law firm, in its Los Angeles office. She received three Presidential appointments confirmed by the U.S. Senate. President Reagan appointed her a member of the National Labor Relations Board in a Democratic seat in 1983 and, in 1986, President Reagan appointed her to a Democratic seat on the Federal Communications Commission, making her the first Latina appointed to the two agencies. President George H.W,. Bush appointed her Assistant Secretary of State for Human Rights and Humanitarian Affairs in 1992, also a first for Latinas.</p>\n<p>Born in Santa Rita, New Mexico, Diaz Dennis holds a law degree from Loyola Law School in Los Angeles where she was Executive Editor of the Loyola Law Review, and an undergraduate degree from UCLA.</p>\n",
        "department": [],
        "roles": []
    },
    "6839": {
        "first_name": "Christopher",
        "last_name": "Dayton, MD",
        "faculty_title": "Leadership Institute Facilitator - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "christopher-dayton-md",
        "fullname": "Christopher Dayton, MD",
        "id": 6839,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/christopher-dayton-md/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6839",
        "media": [
            {
                "id": 6784,
                "alt": "Image of Dr. Christopher Dayton",
                "path": "uploads/2018/08/Dayton-Christopher-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6839-christopher-dayton-md.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Dr. Christopher Dayton is a Clinical Assistant Professor at the University of Texas Health Science Centers in San Antonio Texas (UT Health San Antonio).  He joined the division of Pulmonary and Critical Care Medicine in the Department of Medicine at UT Health San Antonio in 2014. Through Dayton’s career, he has cultivated a diverse and rich experience base in clinical medicine, both in high intensity and low intensity resource settings. The sum of these experiences have shaped his growing interests and areas of expertise, which include: process improvement, health care provision in low resource settings, electronic medical record (EMR) driven early warning systems, point of care ultrasound, and simulation-based training.</p>\n",
        "department": [],
        "roles": []
    },
    "6840": {
        "first_name": "Chris",
        "last_name": "Hajek",
        "faculty_title": "Leadership Institute Facilitator - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "chris-hajek-ph-d",
        "fullname": "Chris Hajek, Ph.D.",
        "id": 6840,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/chris-hajek-ph-d/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6840",
        "media": [
            {
                "id": 6785,
                "alt": "Photo of Chris Hajek Ph.D.",
                "path": "uploads/2018/08/Hajek-Chris-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6840-chris-hajek-ph-d.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Chris Hajek, Ph.D.’s teaching and research are grounded in intergroup, intercultural, and organizational communication in a variety of social and professional contexts. These foci stem, in part, from his past work for CNN and The Associated Press in Rome, and his Peace Corps teaching experience in Rwanda. In addition, his teaching has been influenced by his experience as a trained mediator in community-based alternative dispute resolution. His latest research examines the roles of communication in the formation and management of individuals&#8217; entrepreneurial social identity, with special attention to gender and generational differences.</p>\n",
        "department": [],
        "roles": []
    },
    "6841": {
        "first_name": "Dorinda",
        "last_name": "Rolle",
        "faculty_title": "Leadership Institute Facilitator - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "dorinda-rolle-ph-d",
        "fullname": "Dorinda Rolle, Ph.D., PCC",
        "id": 6841,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/dorinda-rolle-ph-d/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6841",
        "media": [
            {
                "id": 6803,
                "alt": "Photo of Dorinda Rolle, Ph.D.",
                "path": "uploads/2018/08/Rolle-Dorinda-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6841-dorinda-rolle-ph-d.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Dr. Rolle is president of Rolle and Associates, a management consulting and training firm offering services to nonprofit organizations and businesses in the areas of strategic planning, board development, corporate training, group facilitation, research and special projects. She has taught in the Industrial/Organizational Psychology program at St. Mary&#8217;s University and the African American Studies Program at The University of Texas at San Antonio. She conducts executive coaching, leadership training and organizational development consulting and is certified as a Professional Certified Coach (PCC) through the International Coaching Federation (ICF).</p>\n<p>&nbsp;</p>\n",
        "department": [],
        "roles": []
    },
    "6846": {
        "first_name": "Debbie",
        "last_name": "Roos",
        "faculty_title": "Executive Education Coach - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "debbie-roos",
        "fullname": "Debbie Roos",
        "id": 6846,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/debbie-roos/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6846",
        "media": [
            {
                "id": 6813,
                "alt": "Photo of Executive Coach Debbie Roos",
                "path": "uploads/2018/08/Roos-Debbie-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6846-debbie-roos.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Debbie Roos, SHRM-SCP, is the founder of Simply People. She is a Gallup Certified Strengths Coach and is trained to coach entrepreneurs and intrapreneurs in Gallup’s Builder Profile methodology. Roos works with teams of all sizes to help them understand their dynamics and leverage their teammates appropriately. She also works one-on-one with executives, managers, and front-line contributors to set and achieve objectives, both professional and personal. Roos’ coaching experience includes clients in both the profit and non-profit sectors, and in industries ranging from professional services (accounting, legal services, health insurance), religious institutions, and education to retail, construction, and media production. A seasoned leader with 25+ years spent growing and developing people in organizations such as Accenture, USAA, and HEB, Debbie’s coaching career began long before she entered the business world. It began with her father, a retired Brigadier General, coaching her: “If you take care of the people, they’ll take care of you.” This philosophy earned her both the moniker “Chief Gardner” and the San Antonio Business Journal “C-Suite Award” in 2017.</p>\n",
        "department": [],
        "roles": []
    },
    "6847": {
        "first_name": "Christy",
        "last_name": "Rosenfeld",
        "faculty_title": "Executive Education Coach - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "christy-rosenfeld",
        "fullname": "Christy Rosenfeld",
        "id": 6847,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/christy-rosenfeld/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6847",
        "media": [
            {
                "id": 6814,
                "alt": "Photo of Christy Rosenfeld",
                "path": "uploads/2018/08/Rosenfeld-Christy-200x300.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6847-christy-rosenfeld.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Christy Hotard Rosenfeld left Texas after high school to experience life in Colorado. She graduated with a BA in Business Administration from Western State College of Colorado (now called Western State University of Colorado). Then she moved to Washington, DC where she worked in the non-profit field before joining the Peace Corps and serving two years in the Republic of South Africa as a capacity building volunteer for a local non-profit. It was during this time she found her passion for organizational development, specifically training and coaching staff members and creating processes and efficiencies to create a sustainable business model.</p>\n<p>Rosenfeld stayed overseas in South Africa and Zimbabwe for another two years, working as a training consultant and starting her own small sandwich making business, serving a niche market in the expat community and becoming profitable within three months. After a few years, Rosenfeld came back to the states to pursue her masters at the University of Denver. She graduated with an International MBA in Strategic Leadership in 2013 and received the honor of International MBA Advisory Board Student of the Year recognizing her academic success and international experiences. After graduation, she moved back to San Antonio and started a career in health care operations working for a Fortune 500 company as a dialysis clinic manager.</p>\n<p>Rosenfeld transitioned into preventative health care and spent the 2 years managing health and wellness programs and promotion for HEB employees. She designed, launched and administered four major wellness program initiatives, including an inaugural leadership wellness program, helping over 30 leaders within the company improve their health and create sustainable healthy lifestyle practices. Rosenfeld decided to leave HEB to pursue her passion in training/facilitation and organization development. Currently, she is contracting as a Leadership Facilitator and Organization Development Specialist, designing and implementing development opportunities for teams, as well as coaching non-profit leaders and professionals in career transitions. She is an active member of her community, volunteering for SOS Summer of Service San Antonio organization, as well as serving on the board for various non profits including PFLAG San Antonio, San Antonio Young Professionals (combined with LOOP &#8211; Leadership Organization of Young Professionals), and University Presbyterian Children&#8217;s Center.</p>\n<p>Rosenfeld is married to her husband of eight and a half years, Jason, and together they have two boys, plus two energetic dogs Leelu and Cookie.</p>\n",
        "department": [],
        "roles": []
    },
    "6848": {
        "first_name": "Matt",
        "last_name": "Scott",
        "faculty_title": "Executive Education Coach - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "matt-scott",
        "fullname": "Matt Scott",
        "id": 6848,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/matt-scott/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/6848",
        "media": [
            {
                "id": 14661,
                "alt": "Image of Matt Scott",
                "path": "uploads/2018/08/Matt-Scott-Square.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/6848-matt-scott.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Matthew Scott is the Founder and Lead Consultant of The Wired Group, an organizational and strategy consulting firm based in San Antonio, TX. He works with leaders and staff teams of fifty people or less in San Antonio and the surrounding areas to help them to develop clarity of their mission, vision and values; align the team and roles around goals for execution; and maximize talent and engagement across the staff. Scott also speaks and teaches leaders and staff teams on strategic planning, organizational alignment and leadership development. He works with several staff teams and currently leads a staff of over twenty-five employees.</p>\n<p>Scott received a BS in Business from Wake Forest University, with a focus in entrepreneurship and finance, a Juris Doctor from St. Mary’s School of Law with a focus in Estate &amp; Gift Tax Planning, and a Masters of Divinity from Duke University. He is a licensed attorney in the State of Texas, a Certified Birkman Consultant, a Certified Paterson StratOp Facilitator and a Pastor in the United Methodist Church. Matthew and his wife, Christina, are native San Antonians and enjoy exploring the Hill Country of South Texas and all the bar-b-que, Tex-Mex and craft beer that the area has to offer.</p>\n",
        "department": [],
        "roles": []
    },
    "7264": {
        "first_name": "Manuel",
        "last_name": "Rodriguez",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "manuel.rodriguez4@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "manuel-rodriguez-2",
        "fullname": "Manuel Rodriguez",
        "id": 7264,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/manuel-rodriguez-2/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/7264",
        "media": [
            {
                "id": 9873,
                "alt": "Manuel Rodriguez",
                "path": "uploads/2018/10/M.-Rodriguez.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/7264-manuel-rodriguez-2.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "7880": {
        "first_name": "Kyo",
        "last_name": "Koo",
        "faculty_title": "Director of Educational Technology",
        "faculty_email": "kyo.koo@utsa.edu",
        "faculty_phone": "210-458-4773",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.04.26",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Faculty Success and Research",
                "role": "Staff"
            }
        ],
        "uri": "kyo-koo",
        "fullname": "Kyo Koo",
        "id": 7880,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/kyo-koo/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/7880",
        "media": [
            {
                "id": 9794,
                "alt": "",
                "path": "uploads/2019/06/Kyo-Koo-photo.jpg",
                "correctedPath": "faculty/headshots/deans-office/7880-kyo-koo.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "faculty success and research"
        ],
        "roles": [
            "staff"
        ]
    },
    "7936": {
        "first_name": "Daisy",
        "last_name": "Saucedo",
        "faculty_title": "Student Development Specialist",
        "faculty_email": "daisy.saucedo@utsa.edu",
        "faculty_phone": "210-458-7328",
        "faculty_fax": "",
        "faculty_office_number": "Business Building 4.01.18",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Graduate Studies",
                "role": "Staff"
            }
        ],
        "uri": "daisy-saucedo",
        "fullname": "Daisy Saucedo",
        "id": 7936,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/daisy-saucedo/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/7936",
        "media": [
            {
                "id": 24781,
                "alt": "Headshot of Graduate Advisor Daisy Saucedo",
                "path": "uploads/2019/01/Daisy-Saucedo-1.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/7936-daisy-saucedo.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "<p>Graduate Advisor for:</p>\n<ul>\n<li>MBA</li>\n<li>Graduate Certificate:\n<ul>\n<li>Operations and Supply Chain Management</li>\n</ul>\n</li>\n</ul>\n<p><a class=\"btn btnCTA\" href=\"https://calendly.com/daisy-saucedo\" target=\"_blank\" rel=\"noopener noreferrer\">Book a virtual advising session</a></p>\n",
        "department": [
            "graduate studies"
        ],
        "roles": [
            "staff"
        ]
    },
    "9648": {
        "first_name": "Robin",
        "last_name": "Verma",
        "faculty_title": "Lecturer",
        "faculty_email": "robin.verma@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "NPB 2.260",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Cyber Center for Security and Analytics",
                "role": "Staff"
            }
        ],
        "uri": "robin-verma-ph-d",
        "fullname": "Robin Verma, Ph.D.",
        "id": 9648,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/robin-verma-ph-d/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/9648",
        "media": [],
        "topd": "Cyber Center for Security and Analytics",
        "dslug": "cyber-center-for-security-and-analytics",
        "content": "",
        "department": [
            "cyber center for security and analytics"
        ],
        "roles": [
            "staff"
        ]
    },
    "9753": {
        "first_name": "Min",
        "last_name": "Liu",
        "faculty_title": "Administrative Analyst",
        "faculty_email": "min.liu2@utsa.edu",
        "faculty_phone": "210-458-8675",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.12",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Faculty Success and Research",
                "role": "Staff"
            }
        ],
        "uri": "min-liu",
        "fullname": "Min Liu",
        "id": 9753,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/min-liu/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/9753",
        "media": [
            {
                "id": 18584,
                "alt": "Min Liu",
                "path": "uploads/2019/06/Liu_Min_9100-e1627423856270.jpg",
                "correctedPath": "faculty/headshots/deans-office/9753-min-liu.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "faculty success and research"
        ],
        "roles": [
            "staff"
        ]
    },
    "9827": {
        "first_name": "Jacqueline",
        "last_name": "Loden",
        "faculty_title": "Director of Undergraduate Advising",
        "faculty_email": "jackie.loden@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Administrators"
            }
        ],
        "uri": "jacqueline-loden",
        "fullname": "Jacqueline Loden",
        "id": 9827,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jacqueline-loden/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/9827",
        "media": [
            {
                "id": 13069,
                "alt": "Image of Jackie Loden",
                "path": "uploads/2019/07/JackieLoden_5964-e1593707606591.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/9827-jacqueline-loden.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "administrators"
        ]
    },
    "10244": {
        "first_name": "Myron ",
        "last_name": "Anderson",
        "faculty_title": "Leadership Institute Facilitator - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "myron-anderson-ph-d",
        "fullname": "Myron Anderson, Ph.D.",
        "id": 10244,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/myron-anderson-ph-d/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/10244",
        "media": [
            {
                "id": 10245,
                "alt": "Picture of Myron Anderson, Ph.D.",
                "path": "uploads/2019/08/Myron-Anderson_5x7.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/10244-myron-anderson-ph-d.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Myron Anderson is the founding Vice President for Inclusive Excellence at The University of Texas at San Antonio (UTSA) as of January 2019.</p>\n<p>Anderson comes to UTSA from Metropolitan State University of Denver (MSU Denver) where he served as the Associate to the President for Diversity and a tenured Professor in the School of Education. Using inclusive leadership as the framework paralleled with an active leadership strategy, listen, co-create, harvest and implement, Anderson was responsible for developing a University strategic vision to improve campus climate and advance Inclusive Excellence.</p>\n<p>Anderson’s leadership led to MSU Denver being a three-time recipient of the Higher Education Excellence in Diversity (HEED) <em>“Diversity Champions”</em> award. This national award recognizes the top 15 U.S. Colleges and Universities that exemplify an unyielding commitment to diversity and inclusion. Anderson has led the development and implementation of innovative recruitment and retention programs, i.e. the Stealth Recruitment Portal, the Tenure Track Mentorship Program, and the implementation of the University-wide Campus Climate Survey. These programs contributing to MSU Denver’s improving of their campus climate and a 35% increase in the retention of faculty of color.</p>\n<p>Anderson has performed research in the areas of instructional technology, distance education, campus climate, inclusive leadership, diversity, and microaggressions in higher education. His research has led to the creation of a new term “hierarchal microaggressions” identifying new territory where these actions take place. He has published, designed and presented regional, national and international workshops, in the areas of student development, education technology, equity pedagogy, microaggressions, inclusive leadership, diversity and campus climate.</p>\n<p>Anderson earned a Ph.D. in instructional technology, and a bachelor of arts in political science from Virginia Tech, and a master of science in curriculum and instruction from Radford University.</p>\n",
        "department": [],
        "roles": []
    },
    "10385": {
        "first_name": "Christi",
        "last_name": "Zuber",
        "faculty_title": "Academic Advisor",
        "faculty_email": "christi.zuber@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "christi-zuber",
        "fullname": "Christi Zuber",
        "id": 10385,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/christi-zuber/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/10385",
        "media": [],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "10779": {
        "first_name": "Karen",
        "last_name": "Landolt",
        "faculty_title": "EMBA Faculty",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "karen-landolt",
        "fullname": "Karen Landolt",
        "id": 10779,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/karen-landolt/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/10779",
        "media": [
            {
                "id": 10780,
                "alt": "Photo of Karen Landolt",
                "path": "uploads/2019/11/karen_landolt.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/10779-karen-landolt.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Karen M. Landolt has been teaching, coaching, and leading in nonprofit, legal, and academic settings for 25 years. Landolt teaches Business Law, Behavioral Ethics, Entrepreneurship, and Intellectual Property Law. Equally fascinated with pop culture and coaching others to lead with their strengths, she finds creative ways to integrate service, experiential learning, and pop culture into her teaching. Landolt previously practiced intellectual property law at Testa, Hurwitz &amp; Thibeault, LLP, a large venture capital/intellectual property firm, and was a founding partner of Tremont Law Group, LLP, a boutique business and intellectual property firm. Landolt was admitted to the Massachusetts bar in 2001 and is a Certified Mediator. She served as Director of two UT Austin career services offices and is a founding partner of Engage Leadership Consulting, LLC, which focuses on team building for corporations, start-ups, and nonprofits. Landolt completed her Juris Doctor at Northeastern University School of Law and earned her Bachelor of Arts in Government from The University of Texas at Austin.</p>\n",
        "department": [],
        "roles": []
    },
    "10785": {
        "first_name": "Tyler",
        "last_name": "Towers",
        "faculty_title": "Lecturer in Management",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "tyler-towers-ph-d",
        "fullname": "Tyler Towers, Ph.D.",
        "id": 10785,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/tyler-towers-ph-d/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/10785",
        "media": [
            {
                "id": 10788,
                "alt": "Photo of Tyler Towers",
                "path": "uploads/2019/11/Tyler-Towers-square.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/10785-tyler-towers-ph-d.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Tyler J. Towers was born and raised in Salt Lake City, Utah.  He entered the United States Navy in December, 2001 through the Health Services Collegiate Program (HSCP). At that time, he was enrolled in the Master of Health Administration program at the University of Memphis.  Upon completion of his MHA in 2003, he was commissioned a Lieutenant (Junior Grade) in the Navy Medical Service Corps and attended Officer Indoctrination School (OIS) in Newport, Rhode Island.</p>\n<p>Following OIS, Towers reported to Naval Hospital Beaufort, South Carolina, where he served in various administrative roles in the operating management, manpower, and patient administration departments. In November, 2005, he reported for duty at Naval Healthcare New England (NHCNE) in Newport, Rhode Island, where he again occupied various leadership roles within the administration directorate. During his tenure at NHCNE, he deployed to Kuwait in support of Operation Iraqi Freedom.  Early in the deployment, he played an instrumental role in the formation and leadership of Medical Task Force Kuwait, a joint Army-Navy medical command with a presence in Kuwait, Qatar, and Djibouti.</p>\n<p>Upon completion of this deployment, Towers finished his tour at NHCNE and accepted orders to serve as the operations officer for 1st Dental Battalion (1st Marine Logistics Group), Camp Pendleton, California. In this capacity, he earned designation as a Fleet Marine Force Qualified Officer and assisted in the training and qualification of many other Naval officers within 1<span style=\"font-size: 13.3333px;\">st</span> Marine Logistics Group. He was also awarded the Navy and Marine Association Leadership Award in 2009 by the Commanding General, I Marine Expeditionary Force.</p>\n<p>In September, 2009, Towers was selected for Duty Under Instruction, which allowed him to earn a Doctorate in Health Policy and Administration in the civilian sector while remaining on active duty. He commenced his doctoral training at the Pennsylvania State University in August, 2010, and completed the program in May, 2013.</p>\n<p>Towers reported to the Bureau of Medicine and Surgery for his first follow-on tour in August, 2013, where he served as a strategy analyst supporting the Executive Director and, concurrently, as a research fellow at the Center for Naval Analyses (CNA). Following this assignment, he joined the faculty at the top-ranked Army-Baylor University Graduate Program in Health and Business Administration in August 2017 where, in addition to his teaching responsibilities, he led and advised all Navy and Coast Guard officers flowing through the program.</p>\n<p>Beyond his primary duties and obligations, Towers devotes a substantial portion of his time to teaching and training healthcare providers and administrators around the world. Since 2014, he has served as a volunteer instructor with the Defense Institute for Medical Operations (DIMO), completing two separate missions to Pristina, Kosovo in 2015 and 2017, and leading a mission to Maputo, Mozambique in 2019. He began serving as course director for the in-residence Executive Healthcare Resource Management Course in 2019. In addition to his activities with DIMO, Towers was competitively selected for the prestigious Fulbright Specialist Program in June 2017. The Fulbright Specialist Program is a U.S. Department of State initiative that pairs highly qualified academics and professionals with host institutions abroad to share their expertise, strengthen institutional linkages, hone their skills, gain international experience, and learn about other cultures while building capacity at their overseas host institutions.</p>\n<p>Towers personal awards include the Meritorious Service Medal, the Navy and Marine Corps Commendation Medal (three awards), the Navy and Marine Corps Achievement Medal (two awards), and the Army Achievement Medal (two awards). He currently resides with his wife Jamie and their six children in San Antonio, Texas.</p>\n",
        "department": [],
        "roles": []
    },
    "11055": {
        "first_name": "Susan",
        "last_name": "Colorado-Burt",
        "faculty_title": "Director of Engagement and Special Programs <br>Senior Lecturer",
        "faculty_email": "susan.colorado@utsa.edu",
        "faculty_phone": "210-458-8109",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Administrators"
            }
        ],
        "uri": "susan-colorado-burt-ph-d",
        "fullname": "Susan Colorado-Burt, Ph.D.",
        "id": 11055,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/susan-colorado-burt-ph-d/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/11055",
        "media": [
            {
                "id": 18574,
                "alt": "Susan Colorado-Burt",
                "path": "uploads/2019/12/prefered-susan-colorado-e1627423689332.jpg",
                "correctedPath": "faculty/headshots/student-success-center/11055-susan-colorado-burt-ph-d.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "administrators"
        ]
    },
    "11795": {
        "first_name": "Krishna",
        "last_name": "Garza-Baker",
        "faculty_title": "Assistant Director of Experiential Learning Programs",
        "faculty_email": "krishna.garzabaker@utsa.edu",
        "faculty_phone": "210-458-2717",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "krishna-garza-baker",
        "fullname": "Krishna Garza-Baker",
        "id": 11795,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/krishna-garza-baker/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/11795",
        "media": [
            {
                "id": 18576,
                "alt": "Krishna Garza-Baker",
                "path": "uploads/2020/03/GarzaBaker_Krishna_9173-e1627423756998.jpg",
                "correctedPath": "faculty/headshots/student-success-center/11795-krishna-garza-baker.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "12411": {
        "first_name": "Cynthia",
        "last_name": "Brown",
        "faculty_title": "Academic Advisor",
        "faculty_email": "cynthia.brown@utsa.edu",
        "faculty_phone": "210-458-4562",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "cynthia-brown",
        "fullname": "Cynthia Brown",
        "id": 12411,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/cynthia-brown/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/12411",
        "media": [
            {
                "id": 12825,
                "alt": "Image of Cynthia Brown",
                "path": "uploads/2020/05/CynthiaBrown_6689-e1591644988158.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/12411-cynthia-brown.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "13235": {
        "first_name": "Robert ",
        "last_name": "Schmidt",
        "faculty_title": "Executive Education Coach - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "robert-schmidt-leed-ap",
        "fullname": "Robert Schmidt, LEED AP",
        "id": 13235,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/robert-schmidt-leed-ap/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/13235",
        "media": [
            {
                "id": 13236,
                "alt": "Executive Coach Robert Schmidt",
                "path": "uploads/2020/07/Robert-Schmidt-square.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/13235-robert-schmidt-leed-ap.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Schmidt founded SCHMIDT &amp; CO. in the fall of 2012 following over thirty years of success in the design and construction business. Decades of experience working with leaders have reinforced the belief that all leadership skills are the fruit of a person’s inner world – their character and values. Rooted in this vision, Schmidt comes alongside individuals, teams and organizations to cultivate their unique genius within.</p>\n<p>A third-generation engineer and fourth generation entrepreneur, Schmidt received his Bachelor of Science degree in Civil Engineering from the University of Texas at Austin in 1979. Prior to founding Overland Partners Architects in 1987, Schmidt worked for several large construction companies.</p>\n",
        "department": [],
        "roles": []
    },
    "18088": {
        "first_name": "Genesis",
        "last_name": "Valdez",
        "faculty_title": "Employer Relations Manager",
        "faculty_email": "genesis.valdez@utsa.edu",
        "faculty_phone": "210-458-5713",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "genesis-valdez",
        "fullname": "Genesis Valdez",
        "id": 18088,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/genesis-valdez/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/18088",
        "media": [
            {
                "id": 18125,
                "alt": "",
                "path": "uploads/2021/05/Genesis-V-headshot-2.jpg",
                "correctedPath": "faculty/headshots/student-success-center/18088-genesis-valdez.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "18197": {
        "first_name": "Joseph L.",
        "last_name": "Lengyel",
        "faculty_title": "Executive in Residence - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "joseph-lengyel",
        "fullname": "General Joseph L. Lengyel, USAF (Retired)",
        "id": 18197,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/joseph-lengyel/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/18197",
        "media": [
            {
                "id": 18198,
                "alt": "Image of Joseph L. Lengyel",
                "path": "uploads/2021/06/Joseph-L.-Lengyel-Square.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/18197-joseph-lengyel.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>General Lengyel retired from the Air Force as a four-star General. His final military assignment was as the Chief of the National Guard Bureau, where he also served as a member of the Joint Chiefs of Staff. In this capacity, he was a military advisor to the President, the Secretary of Defense, and the National Security Council and was the Department of Defense’s official channel of communication to the Governors and the State Adjutants General on all matters pertaining to the National Guard. As the most senior National Guard Officer in the nation, Lengyel was responsible to oversee the $28B Army and Air National Guard budgets making sure 450K members of the National Guard were trained and ready across the spectrum of all National Guard military capabilities.</p>\n<p>Lengyel was commissioned in 1981 as a graduate of the ROTC program at the University of North Texas in Denton. He served at home and around the world primarily as an F-16 Fighter Pilot. In 1991, General Lengyel joined the Texas Air National Guard and simultaneously started a civilian career as a pilot for Delta Air Lines. General Lengyel held multiple commands in complex environments. Prior to serving at the National Guard Bureau, Lengyel was the Senior Defense Official and Defense Attache in Cairo, Egypt during the Arab Spring.</p>\n<p>Lengyel received an MBA from the University of Tennesse, Knoxville. He spends time as a mentor for new startups at the Capital Factory in Austin, Texas. He is on the Board of Directors for the Space Force Association. He is an Executive in Residence at the University of Texas, San Antonio, and he is providing services as a consultant for several clients. He and his wife Sally reside in the Hill Country north of San Antonio, Texas. They have three grown children and three grandchildren.</p>\n",
        "department": [],
        "roles": []
    },
    "19149": {
        "first_name": "Grace",
        "last_name": "Calpus",
        "faculty_title": "Executive Education Coach - Center for Professional Excellence",
        "faculty_email": "",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": null,
        "uri": "grace-calpus",
        "fullname": "Grace Calpus",
        "id": 19149,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/grace-calpus/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/19149",
        "media": [
            {
                "id": 19150,
                "alt": "Grace Calpus, UTSA Alvarez College of Business Executive Coach",
                "path": "uploads/2021/09/Grace-Calpus.jpg",
                "correctedPath": "faculty/headshots/center-for-professional-excellence/19149-grace-calpus.jpg"
            }
        ],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "<p>Grace Calpus, BSN, RN, MPA, PCC, has been professionally coaching since 2013 and earned her professional coaching certification from the International Coaching Federation. Her clients have ranged from small business owners, to health care systems and now she focuses much of her attention on leadership coaching in higher education institutions with both students and executive clients. Calpus has professional experience in the following areas:</p>\n<p>• Entrepreneurship<br />\n• Health Care<br />\n• Emotional Intelligence<br />\n• Non-profit management<br />\n• Higher Education<br />\n• Government and legislation</p>\n",
        "department": [],
        "roles": []
    },
    "19527": {
        "first_name": "Sara",
        "last_name": "Gothelf",
        "faculty_title": "Program Manager",
        "faculty_email": "sara.gothelf@utsa.edu",
        "faculty_phone": "210-458-5973",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "sara-gothelf",
        "fullname": "Sara Gothelf",
        "id": 19527,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/sara-gothelf/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/19527",
        "media": [
            {
                "id": 19754,
                "alt": "",
                "path": "uploads/2021/10/IMG_0285-scaled.jpg",
                "correctedPath": "faculty/headshots/student-success-center/19527-sara-gothelf.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "19704": {
        "first_name": "Kailey",
        "last_name": "Villarreal",
        "faculty_title": "Program Coordinator",
        "faculty_email": "kailey.villarreal@utsa.edu",
        "faculty_phone": "210-458-7311",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.08",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "kailey-renee-villarreal",
        "fullname": "Kailey Villarreal",
        "id": 19704,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/kailey-renee-villarreal/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/19704",
        "media": [
            {
                "id": 20092,
                "alt": "Kailey Villarreal",
                "path": "uploads/2021/11/Kailey-Villarreal-Profile-Picture-scaled.jpg",
                "correctedPath": "faculty/headshots/deans-office/19704-kailey-renee-villarreal.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "19747": {
        "first_name": "Eduardo",
        "last_name": "Alvarez",
        "faculty_title": "Business Service Center Manager",
        "faculty_email": "eduardo.alvarez@utsa.edu",
        "faculty_phone": "210-458-5247",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "eduardo-alvarez",
        "fullname": "Eduardo Alvarez",
        "id": 19747,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/eduardo-alvarez/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/19747",
        "media": [
            {
                "id": 22847,
                "alt": "Eduardo Alvarez Profile Picture",
                "path": "uploads/2021/11/ACOB-Directory-picture_E.-Alvarez-scaled.jpg",
                "correctedPath": "faculty/headshots/business-service-center/19747-eduardo-alvarez.jpg"
            }
        ],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "21010": {
        "first_name": "Francisco",
        "last_name": "Marquez",
        "faculty_title": "Assistant Dean of Graduate Studies and Research",
        "faculty_email": "Francisco.marquez@utsa.edu",
        "faculty_phone": "210-458-4312",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.18G",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Graduate Studies",
                "role": "Administrators"
            }
        ],
        "uri": "francisco-marquez-2",
        "fullname": "Francisco Marquez",
        "id": 21010,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/francisco-marquez-2/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/21010",
        "media": [
            {
                "id": 21228,
                "alt": "Francisco Marquez",
                "path": "uploads/2022/02/Francisco-Marquez_Profile-Picture-rotated-e1648825390198.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/21010-francisco-marquez-2.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "<p>Francisco Marquez’ career includes over 17 years of experience leading graduate admissions, national and international recruitment efforts, program operations and assessment and student services and support in public universities. Before joining UTSA, he was director of graduate studies at Florida Gulf Coast University for seven years and assistant director of the Chapman Graduate School of Business at Florida International University.</p>\n<p>Marquez holds a Bachelor’s in Business Administration from Javeriana University in Colombia and a Master of Science in Management Information Systems from Florida International University.</p>\n",
        "department": [
            "graduate studies"
        ],
        "roles": [
            "administrators"
        ]
    },
    "21928": {
        "first_name": "Jonathon",
        "last_name": "Halbesleben",
        "faculty_title": "Dean and Bodenstedt Chair <br> Tom C. Frost Distinguished University Chair for Business Excellence <br> Professor of Management",
        "faculty_email": "jonathon.halbesleben@utsa.edu",
        "faculty_phone": "210-458-4313",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Management",
                "role": "Faculty"
            },
            {
                "department": "Dean's Office",
                "role": "Administrators"
            }
        ],
        "uri": "jonathon-halbesleben",
        "fullname": "Jonathon Halbesleben, Ph.D.",
        "id": 21928,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jonathon-halbesleben/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/21928",
        "media": [
            {
                "id": 23790,
                "alt": "Jonathon Halbesleben",
                "path": "uploads/2022/12/dean-jh-3-e1670952200395.jpg",
                "correctedPath": "faculty/headshots/deans-office/21928-jonathon-halbesleben.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "<h3><strong>Degrees</strong></h3>\n<ul>\n<li>Ph.D. University of Oklahoma</li>\n<li>M.S. University of Oklahoma</li>\n<li>B.S. Winona State University</li>\n</ul>\n<h3><strong>About</strong></h3>\n<p>Jonathon Halbesleben began his duties as the seventh dean of the Carlos Alvarez College of Business at The University of Texas at San Antonio on June 1, 2022. He is the first dean to hold two chaired appointments as the Bodenstedt Chair for the Dean of Business and Tom C. Frost Distinguished University Chair for Business Excellence.</p>\n<p>Halbesleben has a demonstrated record of collaboration in leading complex educational enterprises that advance the goals of the university, support faculty and students and meet the needs of the regional and local business community.</p>\n<p>In addition to his administrative duties at UTSA, Halbesleben will serve as a professor of management. He has written or edited 17 books and published over 95 peer-reviewed journal articles.</p>\n<p>His research has been funded by the National Institute for Occupational Safety and Health, Agency for Healthcare Research and Quality, Centers for Disease Control and Prevention and Department of Defense, among others. He is a fellow of the American Psychological Association and Society for Industrial and Organizational Psychology.</p>\n<p>Prior to joining UTSA, Halbesleben was an administrator at the University of Alabama, first as senior associate dean and Russell Professor of Business Administration in the Culverhouse College of Business and then as dean of the College of Continuing Studies. Previous faculty positions included stints at the University of Wisconsin-Eau Claire and the University of Missouri.</p>\n<p>Halbesleben earned his Ph.D. and M.S. in industrial/organizational psychology from the University of Oklahoma and a bachelor's degree from Winona State University.</p>\n<p><a class=\"btn btnCTA\" href=\"https://business.utsa.edu/dean-event-request/\" target=\"_blank\" rel=\"noopener noreferrer\">Invite to an Event</a></p>\n<p><iframe loading=\"lazy\" src=\"https://player.simplecast.com/0c905698-65d9-46cf-a12e-ec7fb0f8209d?dark=false\" width=\"60%\" height=\"200px\" frameborder=\"no\" scrolling=\"no\" seamless=\"\"></iframe></p>\n<h3><strong>Research Interests</strong></h3>\n<ul>\n<li>Employee well-being</li>\n<li>Work-family issues</li>\n<li>Relationships in and out of the workplace</li>\n</ul>\n<h3><strong>Selected Publications</strong></h3>\n<ul>\n<li><em>Research in Personnel and Human Resource Management,</em> with M. R. Buckley, A. R. Wheeler and J. Baur,  Vol. 40, Bingley, UK: Emerald, 2022.</li>\n<li><em>Managing Stress and Preventing Burnout in the Healthcare Workplace</em> (2nd edition), Chicago: Health Administration Press, 2022.</li>\n<li>&#8220;Decomposing the Reciprocal Nature of Workplace Mistreatment: A Social Network Perspective,&#8221; with D. Kluemper, M. Bowler, S. Taylor and M. Bing, <em>Journal of Applied Psychology</em>, Vol. 104, 2019, pp. 946-964.</li>\n<li>&#8220;Conservation of Resources in the Organizational Context: The Reality of Resources and Their Consequences,&#8221; with S. E. Hobfoll,  J. Neveu  and M. Westman,  <em>Annual Review of Organizational Psychology and Organizational Behavior</em>, Vol. 5, 2018, pp. 103-128.</li>\n<li>&#8220;Misalignment and Misperception in Preferences to Utilize Family-friendly Benefits: Implications for Benefit Utilization and Work-family Conflict,&#8221; with A. M. Mandeville and M. V. Whitman, <em>Personnel Psychology</em>, Vol. 69, 2016, pp. 895-929.</li>\n<li>&#8220;The Work-family Interface and Promotability: A Double-edged Sword,&#8221; with S. C. Paustian-Underdahl, D.C. Carlson and K. M. Kacmar, <em>Journal of Management</em>, Vol. 42, 2016, pp. 960-981.</li>\n<li>&#8220;Getting to the COR: Understanding the Role of Resources in Conservation of Resources Theory,&#8221; with J. P. Neveu, S. C. Paustian-Underdahl and M. Westman, <em>Journal of Management</em>, Vol. 40, 2014, pp. 1334-1364.</li>\n<li>&#8220;The Impact of Furloughs on Emotional Exhaustion, Performance, and Recovery Experiences,&#8221; with A. R. Wheeler and S.C. Paustian-Underdahl,  <em>Journal of Applied Psychology</em>, Vol. 98, 2013, pp. 492-503.</li>\n</ul>\n",
        "department": [
            "management",
            "dean's office"
        ],
        "roles": [
            "faculty",
            "administrators"
        ]
    },
    "22087": {
        "first_name": "Brittney",
        "last_name": "Johnson",
        "faculty_title": "Multimedia Specialist II",
        "faculty_email": "Brittney.Johnson@utsa.edu",
        "faculty_phone": "210-458-3501",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.08",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "brittney-johnson",
        "fullname": "Brittney Johnson",
        "id": 22087,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/brittney-johnson/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/22087",
        "media": [
            {
                "id": 22089,
                "alt": "Brittney Johnson",
                "path": "uploads/2022/06/IMG_0169.jpg",
                "correctedPath": "faculty/headshots/deans-office/22087-brittney-johnson.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "22508": {
        "first_name": "Jagmeet",
        "last_name": "Cheema",
        "faculty_title": "Director of Business Intelligence",
        "faculty_email": "jagmeet.cheema@utsa.edu",
        "faculty_phone": "210-458-7316",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.04.26B",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Faculty Success and Research",
                "role": "Staff"
            }
        ],
        "uri": "jagmeet-cheema",
        "fullname": "Jagmeet Cheema",
        "id": 22508,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jagmeet-cheema/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/22508",
        "media": [
            {
                "id": 25372,
                "alt": "",
                "path": "uploads/2022/07/jameet-cheema-1-square.jpg",
                "correctedPath": "faculty/headshots/deans-office/22508-jagmeet-cheema.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "faculty success and research"
        ],
        "roles": [
            "staff"
        ]
    },
    "22782": {
        "first_name": "Emily",
        "last_name": "Markopoulos",
        "faculty_title": "Program Manager",
        "faculty_email": "emily.markopoulos@utsa.edu ",
        "faculty_phone": "210-458-2203",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04M",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "emily-markopoulos",
        "fullname": "Emily Markopoulos",
        "id": 22782,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/emily-markopoulos/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/22782",
        "media": [
            {
                "id": 22839,
                "alt": "",
                "path": "uploads/2022/08/Emily-Markopoulos-headshot-682x682-1.jpg",
                "correctedPath": "faculty/headshots/student-success-center/22782-emily-markopoulos.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "22976": {
        "first_name": "Rebekah",
        "last_name": "Alegria",
        "faculty_title": "Communications Specialist",
        "faculty_email": "rebekah.alegria@utsa.edu",
        "faculty_phone": "210-458-6909",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.08",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "rebekah-alegria",
        "fullname": "Rebekah Alegria",
        "id": 22976,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/rebekah-alegria/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/22976",
        "media": [
            {
                "id": 22977,
                "alt": "Rebekah Alegria",
                "path": "uploads/2022/09/profile-photo.jpg",
                "correctedPath": "faculty/headshots/deans-office/22976-rebekah-alegria.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "22992": {
        "first_name": "LaTanya",
        "last_name": "Henry",
        "faculty_title": "Program Manager",
        "faculty_email": "latanya.henry@utsa.edu",
        "faculty_phone": "210-458-5525",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "latanya-henry",
        "fullname": "LaTanya Henry",
        "id": 22992,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/latanya-henry/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/22992",
        "media": [
            {
                "id": 23327,
                "alt": "LaTanya Henry",
                "path": "uploads/2022/09/Latanya-Henry-e1665080002498.jpg",
                "correctedPath": "faculty/headshots/student-success-center/22992-latanya-henry.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "23427": {
        "first_name": "Alexandria",
        "last_name": "Vigil",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "Alexandria.Vigil@utsa.edu",
        "faculty_phone": "210-458-6890",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "alexandria-vigil",
        "fullname": "Alexandria Vigil",
        "id": 23427,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/alexandria-vigil/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23427",
        "media": [
            {
                "id": 23435,
                "alt": "",
                "path": "uploads/2022/10/Vigil-Alexandria_01.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/23427-alexandria-vigil.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "23436": {
        "first_name": "AmandaRae",
        "last_name": "Rodriguez",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "AmandaRae.Rodriguez@utsa.edu",
        "faculty_phone": "210-458-4900",
        "faculty_fax": "",
        "faculty_office_number": "SSC",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "amandarae-rodriguez",
        "fullname": "AmandaRae Rodriguez",
        "id": 23436,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/amandarae-rodriguez/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23436",
        "media": [
            {
                "id": 23439,
                "alt": "AmandaRae Rodriguez",
                "path": "uploads/2022/10/Rodriguez-AmandaRae_04-scaled.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/23436-amandarae-rodriguez.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "23440": {
        "first_name": "Kaitlyn",
        "last_name": "Hatfield",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "Kaitlyn.Hatfield@utsa.edu",
        "faculty_phone": "210-458-4900",
        "faculty_fax": "",
        "faculty_office_number": "Kaitlyn.Hatfield@utsa.edu",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "kaitlyn-hatfield",
        "fullname": "Kaitlyn Hatfield",
        "id": 23440,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/kaitlyn-hatfield/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23440",
        "media": [
            {
                "id": 23442,
                "alt": "Kaitlyn Hatfield",
                "path": "uploads/2022/10/Hatfield-Kaitlyn_09-scaled.jpg",
                "correctedPath": "faculty/headshots/undergraduate-advising/23440-kaitlyn-hatfield.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "23443": {
        "first_name": "Michael",
        "last_name": "Segura",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "Michael.Segura@utsa.edu",
        "faculty_phone": "210-458-4900",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "michael-segura",
        "fullname": "Michael Segura",
        "id": 23443,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/michael-segura/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23443",
        "media": [
            {
                "id": 24877,
                "alt": "",
                "path": "uploads/2023/02/Male-silhouette.png",
                "correctedPath": "faculty/headshots/undergraduate-advising/23443-michael-segura.jpg"
            }
        ],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "23446": {
        "first_name": "Tabatha",
        "last_name": "McDaniel",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "Tabatha.McDaniel@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "tabatha-mcdaniel",
        "fullname": "Tabatha McDaniel",
        "id": 23446,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/tabatha-mcdaniel/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23446",
        "media": [],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "23484": {
        "first_name": "Molly",
        "last_name": "Miller",
        "faculty_title": "Program Manager",
        "faculty_email": "molly.miller@utsa.edu",
        "faculty_phone": "210-458-7301",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01-18 A2",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Graduate Studies",
                "role": "Staff"
            }
        ],
        "uri": "molly-miller",
        "fullname": "Molly Miller",
        "id": 23484,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/molly-miller/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23484",
        "media": [
            {
                "id": 23566,
                "alt": "Image of Molly Miller, Program Manager, Graduate Studies, UTSA Alvarez College of Business",
                "path": "uploads/2022/11/Molly-Miller-square.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/23484-molly-miller.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "",
        "department": [
            "graduate studies"
        ],
        "roles": [
            "staff"
        ]
    },
    "23632": {
        "first_name": "Jaimee'",
        "last_name": "Bennett",
        "faculty_title": "Program Manager",
        "faculty_email": "jaimee.bennett@utsa.edu",
        "faculty_phone": "210-458-3622",
        "faculty_fax": "",
        "faculty_office_number": "BB 1.01.20",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Center for Professional Excellence",
                "role": "Staff"
            }
        ],
        "uri": "jaimee-bennett",
        "fullname": "Jaimee&#8217; Bennett",
        "id": 23632,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jaimee-bennett/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23632",
        "media": [],
        "topd": "Center for Professional Excellence",
        "dslug": "center-for-professional-excellence",
        "content": "",
        "department": [
            "center for professional excellence"
        ],
        "roles": [
            "staff"
        ]
    },
    "23714": {
        "first_name": "Sylvia",
        "last_name": "Rayko",
        "faculty_title": "Business Service Center Specialist II",
        "faculty_email": "sylvia.rayko@utsa.edu",
        "faculty_phone": "210-458-7465",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "sylvia-rayko",
        "fullname": "Sylvia Rayko",
        "id": 23714,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/sylvia-rayko/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23714",
        "media": [],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "23715": {
        "first_name": "Elizabeth",
        "last_name": "Sandoval",
        "faculty_title": "Research Program Manager",
        "faculty_email": "elizabeth.sandoval@utsa.edu",
        "faculty_phone": "210-458-8134",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.03.35C",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Faculty Success and Research",
                "role": "Staff"
            }
        ],
        "uri": "elizabeth-sandoval",
        "fullname": "Elizabeth Sandoval",
        "id": 23715,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/elizabeth-sandoval/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23715",
        "media": [
            {
                "id": 26264,
                "alt": "",
                "path": "uploads/2022/12/elizabeth-sandoval.png",
                "correctedPath": "faculty/headshots/graduate-studies/23715-elizabeth-sandoval.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "",
        "department": [
            "faculty success and research"
        ],
        "roles": [
            "staff"
        ]
    },
    "23718": {
        "first_name": "Rachel",
        "last_name": "Henry",
        "faculty_title": "Program Coordinator",
        "faculty_email": "rachel.henry@utsa.edu",
        "faculty_phone": "210-458-6149",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            },
            {
                "department": "Undergraduate Studies",
                "role": "Staff"
            }
        ],
        "uri": "rachel-henry",
        "fullname": "Rachel Henry",
        "id": 23718,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/rachel-henry/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23718",
        "media": [
            {
                "id": 23719,
                "alt": "Rachel Henry",
                "path": "uploads/2022/12/ID-pic.jpg",
                "correctedPath": "faculty/headshots/student-success-center/23718-rachel-henry.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center",
            "undergraduate studies"
        ],
        "roles": [
            "staff",
            "staff"
        ]
    },
    "23998": {
        "first_name": "Blaine",
        "last_name": "Willis",
        "faculty_title": "Senior Systems Administrator",
        "faculty_email": "blaine.willis@utsa.edu",
        "faculty_phone": "210-458-4773",
        "faculty_fax": "",
        "faculty_office_number": "BB 3.03.18",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Academic Computing",
                "role": "Staff"
            },
            {
                "department": "Administration",
                "role": "Staff"
            }
        ],
        "uri": "blaine-willis",
        "fullname": "Blaine Willis",
        "id": 23998,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/blaine-willis/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/23998",
        "media": [],
        "topd": "Academic Computing",
        "dslug": "academic-computing",
        "content": "",
        "department": [
            "academic computing",
            "administration"
        ],
        "roles": [
            "staff",
            "staff"
        ]
    },
    "24161": {
        "first_name": "Joseph",
        "last_name": "Ortiz",
        "faculty_title": "Financial Data/Reporting Manager",
        "faculty_email": "joseph.ortiz@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "joseph-ortiz",
        "fullname": "Joseph Ortiz",
        "id": 24161,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/joseph-ortiz/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/24161",
        "media": [],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "24208": {
        "first_name": "John",
        "last_name": "McGee",
        "faculty_title": "Business Service Center Specialist II",
        "faculty_email": "john.mcgee@utsa.edu",
        "faculty_phone": "210-458-3117",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.06.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "john-mcgee",
        "fullname": "John McGee",
        "id": 24208,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/john-mcgee/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/24208",
        "media": [
            {
                "id": 24877,
                "alt": "",
                "path": "uploads/2023/02/Male-silhouette.png",
                "correctedPath": "faculty/headshots/business-service-center/24208-john-mcgee.jpg"
            }
        ],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "24345": {
        "first_name": "Eunice",
        "last_name": "Chen",
        "faculty_title": "Financial Analyst",
        "faculty_email": "Eunice.chen@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Business Service Center",
                "role": "Staff"
            }
        ],
        "uri": "eunice-chen",
        "fullname": "Eunice Chen",
        "id": 24345,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/eunice-chen/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/24345",
        "media": [],
        "topd": "Business Service Center",
        "dslug": "business-service-center",
        "content": "",
        "department": [
            "business service center"
        ],
        "roles": [
            "staff"
        ]
    },
    "24388": {
        "first_name": "Alejandra",
        "last_name": "Santos",
        "faculty_title": "Project Coordinator",
        "faculty_email": "alejandra.santos@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "alejandra-santos",
        "fullname": "Alejandra Santos",
        "id": 24388,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/alejandra-santos/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/24388",
        "media": [
            {
                "id": 26226,
                "alt": "Alejandra Santos",
                "path": "uploads/2023/09/Alejandra_Santos-1.png",
                "correctedPath": "faculty/headshots/student-success-center/24388-alejandra-santos.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "24793": {
        "first_name": "Debbie",
        "last_name": "Bearden",
        "faculty_title": "Business Operations Manager",
        "faculty_email": "debbie.bearden@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.02.04",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "debbie-bearden",
        "fullname": "Debbie Bearden",
        "id": 24793,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/debbie-bearden/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/24793",
        "media": [],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "25177": {
        "first_name": "Don",
        "last_name": "Carrington",
        "faculty_title": "Assistant Director Doctoral Programs and Fiscal Administration",
        "faculty_email": "Don.Carrington@utsa.edu",
        "faculty_phone": "210-458-5281",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.18D",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Faculty Success and Research",
                "role": "Staff"
            },
            {
                "department": "Doctoral Studies",
                "role": "Staff"
            }
        ],
        "uri": "don-carrington",
        "fullname": "Don Carrington",
        "id": 25177,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/don-carrington/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/25177",
        "media": [
            {
                "id": 25202,
                "alt": "Headshot of Don Carrington",
                "path": "uploads/2023/05/Don-Carrington-e1687376266627.jpg",
                "correctedPath": "faculty/headshots/faculty-success-and-research/25177-don-carrington.jpg"
            }
        ],
        "topd": "Faculty Success and Research",
        "dslug": "faculty-success-and-research",
        "content": "",
        "department": [
            "faculty success and research",
            "doctoral studies"
        ],
        "roles": [
            "staff",
            "staff"
        ]
    },
    "25178": {
        "first_name": "Helena",
        "last_name": "Fischer",
        "faculty_title": "Senior Grant Development Manager",
        "faculty_email": "helena.fischer@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.03.35A",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Faculty Success and Research",
                "role": "Staff"
            }
        ],
        "uri": "helena-fischer",
        "fullname": "Helena Fischer",
        "id": 25178,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/helena-fischer/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/25178",
        "media": [],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "",
        "department": [
            "faculty success and research"
        ],
        "roles": [
            "staff"
        ]
    },
    "25180": {
        "first_name": "Claudia",
        "last_name": "Ortiz",
        "faculty_title": "Manager of Strategic Initiatives",
        "faculty_email": "claudia.ortiz@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.03.35B",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Faculty Success and Research",
                "role": "Staff"
            }
        ],
        "uri": "claudia-ortiz",
        "fullname": "Claudia Ortiz",
        "id": 25180,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/claudia-ortiz/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/25180",
        "media": [
            {
                "id": 25204,
                "alt": "Headshot of Claudia Ortiz",
                "path": "uploads/2023/05/Claudia-Ortiz-Headshot.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/25180-claudia-ortiz.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "",
        "department": [
            "faculty success and research"
        ],
        "roles": [
            "staff"
        ]
    },
    "25448": {
        "first_name": "Marisa",
        "last_name": "Orozco",
        "faculty_title": "Senior Program Coordinator",
        "faculty_email": "marissa.orozco@utsa.edu",
        "faculty_phone": "210-458-4494",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.02",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "marissa-orozco",
        "fullname": "Marissa Orozco",
        "id": 25448,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/marissa-orozco/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/25448",
        "media": [
            {
                "id": 25449,
                "alt": "Marissa Orozco",
                "path": "uploads/2023/06/pfp.png",
                "correctedPath": "faculty/headshots/deans-office/25448-marissa-orozco.jpg"
            }
        ],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "25550": {
        "first_name": "Jose",
        "last_name": "Bayona",
        "faculty_title": "Academic Advisor I",
        "faculty_email": "jose.bayona@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Undergraduate Advising",
                "role": "Staff"
            }
        ],
        "uri": "jose-bayona",
        "fullname": "Jose Bayona",
        "id": 25550,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/jose-bayona/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/25550",
        "media": [],
        "topd": "Undergraduate Advising",
        "dslug": "undergraduate-advising",
        "content": "",
        "department": [
            "undergraduate advising"
        ],
        "roles": [
            "staff"
        ]
    },
    "26005": {
        "first_name": "Sabrina",
        "last_name": "Arismendez ",
        "faculty_title": "Project Coordinator - Experiential Learning",
        "faculty_email": "sabrina.arismendez@utsa.edu",
        "faculty_phone": "210-458-2200",
        "faculty_fax": "",
        "faculty_office_number": "BB 2.01.08",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Student Success Center",
                "role": "Staff"
            }
        ],
        "uri": "sabrina-arismendez",
        "fullname": "Sabrina Arismendez",
        "id": 26005,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/sabrina-arismendez/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/26005",
        "media": [
            {
                "id": 26164,
                "alt": "",
                "path": "uploads/2023/08/sabrina.arismendez.jpg",
                "correctedPath": "faculty/headshots/student-success-center/26005-sabrina-arismendez.jpg"
            }
        ],
        "topd": "Student Success Center",
        "dslug": "student-success-center",
        "content": "",
        "department": [
            "student success center"
        ],
        "roles": [
            "staff"
        ]
    },
    "26052": {
        "first_name": "Sarah",
        "last_name": "Miller",
        "faculty_title": "Associate Director of Development",
        "faculty_email": "sarah.osborn@utsa.edu",
        "faculty_phone": "210-458-7298",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.02L2",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Dean's Office",
                "role": "Staff"
            }
        ],
        "uri": "sarah-miller",
        "fullname": "Sarah Miller",
        "id": 26052,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/sarah-miller/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/26052",
        "media": [],
        "topd": "Dean's Office",
        "dslug": "deans-office",
        "content": "",
        "department": [
            "dean's office"
        ],
        "roles": [
            "staff"
        ]
    },
    "26232": {
        "first_name": "Haley",
        "last_name": "Meyer",
        "faculty_title": "Student Development Specialist III",
        "faculty_email": "haley.meyer@utsa.edu",
        "faculty_phone": "",
        "faculty_fax": "",
        "faculty_office_number": "BB 4.01.18C",
        "faculty_pdf": "",
        "faculty_additional_info": "",
        "department_role_repeater": [
            {
                "department": "Graduate Studies",
                "role": "Staff"
            }
        ],
        "uri": "haley-meyer",
        "fullname": "Haley Meyer",
        "id": 26232,
        "status": "publish",
        "link": "https://business.utsa.edu/faculty/haley-meyer/",
        "json": "https://business.utsa.edu/wp-json/wp/v2/faculty/26232",
        "media": [
            {
                "id": 26316,
                "alt": "Haley Meyer",
                "path": "uploads/2023/09/haley.meyer_.jpg",
                "correctedPath": "faculty/headshots/graduate-studies/26232-haley-meyer.jpg"
            }
        ],
        "topd": "Graduate Studies",
        "dslug": "graduate-studies",
        "content": "<p>Graduate Advisor for:</p>\n<ul>\n<li>M.A. Economics</li>\n<li>M.S. Business</li>\n<li>M.S. Finance</li>\n<li>M.S. Management of Technology</li>\n</ul>\n<p>Graduate Certificates:</p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>Project Management</li>\n<li>Real Estate Finance and Development</li>\n<li>Technology, Entrepreneurship and Management</li>\n</ul>\n</li>\n</ul>\n",
        "department": [
            "graduate studies"
        ],
        "roles": [
            "staff"
        ]
    }
}